**Text-to-SQL Project**

Study of one of the IBM Granite model, here the 20B parameters code base 8K, for the generation of SQL queries from question in natural language.

**I-** Load the model and the dataset

In [1]:
!pip install transformers bitsandbytes accelerate datasets outlines scikit-learn sqlvalidator

Requirement already satisfied: transformers in /usr/local/lib/python3.10/dist-packages (4.47.1)
Collecting bitsandbytes
  Downloading bitsandbytes-0.45.0-py3-none-manylinux_2_24_x86_64.whl.metadata (2.9 kB)
Requirement already satisfied: accelerate in /usr/local/lib/python3.10/dist-packages (1.2.1)
Collecting datasets
  Downloading datasets-3.2.0-py3-none-any.whl.metadata (20 kB)
Collecting outlines
  Downloading outlines-0.1.11-py3-none-any.whl.metadata (17 kB)
Requirement already satisfied: scikit-learn in /usr/local/lib/python3.10/dist-packages (1.6.0)
Collecting sqlvalidator
  Downloading sqlvalidator-0.0.20-py3-none-any.whl.metadata (4.8 kB)
Requirement already satisfied: filelock in /usr/local/lib/python3.10/dist-packages (from transformers) (3.16.1)
Requirement already satisfied: huggingface-hub<1.0,>=0.24.0 in /usr/local/lib/python3.10/dist-packages (from transformers) (0.27.0)
Requirement already satisfied: numpy>=1.17 in /usr/local/lib/python3.10/dist-packages (from transformers) (1.26.4)
Requirement already satisfied: packaging>=20.0 in /usr/local/lib/python3.10/dist-packages (from transformers) (24.2)
Requirement already satisfied: pyyaml>=5.1 in /usr/local/lib/python3.10/dist-packages (from transformers) (6.0.2)
Requirement already satisfied: regex!=2019.12.17 in /usr/local/lib/python3.10/dist-packages (from transformers) (2024.11.6)
Requirement already satisfied: requests in /usr/local/lib/python3.10/dist-packages (from transformers) (2.32.3)
Requirement already satisfied: tokenizers<0.22,>=0.21 in /usr/local/lib/python3.10/dist-packages (from transformers) (0.21.0)
Requirement already satisfied: safetensors>=0.4.1 in /usr/local/lib/python3.10/dist-packages (from transformers) (0.4.5)
Requirement already satisfied: tqdm>=4.27 in /usr/local/lib/python3.10/dist-packages (from transformers) (4.67.1)
Requirement already satisfied: torch in /usr/local/lib/python3.10/dist-packages (from bitsandbytes) (2.5.1+cu121)
Requirement already satisfied: typing_extensions>=4.8.0 in /usr/local/lib/python3.10/dist-packages (from bitsandbytes) (4.12.2)
Requirement already satisfied: psutil in /usr/local/lib/python3.10/dist-packages (from accelerate) (5.9.5)
Requirement already satisfied: pyarrow>=15.0.0 in /usr/local/lib/python3.10/dist-packages (from datasets) (17.0.0)
Collecting dill<0.3.9,>=0.3.0 (from datasets)
  Downloading dill-0.3.8-py3-none-any.whl.metadata (10 kB)
Requirement already satisfied: pandas in /usr/local/lib/python3.10/dist-packages (from datasets) (2.2.2)
Collecting xxhash (from datasets)
  Downloading xxhash-3.5.0-cp310-cp310-manylinux_2_17_x86_64.manylinux2014_x86_64.whl.metadata (12 kB)
Collecting multiprocess<0.70.17 (from datasets)
  Downloading multiprocess-0.70.16-py310-none-any.whl.metadata (7.2 kB)
Collecting fsspec<=2024.9.0,>=2023.1.0 (from fsspec[http]<=2024.9.0,>=2023.1.0->datasets)
  Downloading fsspec-2024.9.0-py3-none-any.whl.metadata (11 kB)
Requirement already satisfied: aiohttp in /usr/local/lib/python3.10/dist-packages (from datasets) (3.11.10)
Collecting interegular (from outlines)
  Downloading interegular-0.3.3-py37-none-any.whl.metadata (3.0 kB)
Requirement already satisfied: jinja2 in /usr/local/lib/python3.10/dist-packages (from outlines) (3.1.4)
Collecting lark (from outlines)
  Downloading lark-1.2.2-py3-none-any.whl.metadata (1.8 kB)
Requirement already satisfied: nest_asyncio in /usr/local/lib/python3.10/dist-packages (from outlines) (1.6.0)
Requirement already satisfied: cloudpickle in /usr/local/lib/python3.10/dist-packages (from outlines) (3.1.0)
Collecting diskcache (from outlines)
  Downloading diskcache-5.6.3-py3-none-any.whl.metadata (20 kB)
Requirement already satisfied: pydantic>=2.0 in /usr/local/lib/python3.10/dist-packages (from outlines) (2.10.3)
Requirement already satisfied: referencing in /usr/local/lib/python3.10/dist-packages (from outlines) (0.35.1)
Requirement already satisfied: jsonschema in /usr/local/lib/python3.10/dist-packages (from outlines) (4.23.0)
Collecting pycountry (from outlines)
  Downloading pycountry-24.6.1-py3-none-any.whl.metadata (12 kB)
Collecting airportsdata (from outlines)
  Downloading airportsdata-20241001-py3-none-any.whl.metadata (8.9 kB)
Collecting outlines_core==0.1.26 (from outlines)
  Downloading outlines_core-0.1.26-cp310-cp310-manylinux_2_17_x86_64.manylinux2014_x86_64.whl.metadata (3.8 kB)
Requirement already satisfied: scipy>=1.6.0 in /usr/local/lib/python3.10/dist-packages (from scikit-learn) (1.13.1)
Requirement already satisfied: joblib>=1.2.0 in /usr/local/lib/python3.10/dist-packages (from scikit-learn) (1.4.2)
Requirement already satisfied: threadpoolctl>=3.1.0 in /usr/local/lib/python3.10/dist-packages (from scikit-learn) (3.5.0)
Requirement already satisfied: aiohappyeyeballs>=2.3.0 in /usr/local/lib/python3.10/dist-packages (from aiohttp->datasets) (2.4.4)
Requirement already satisfied: aiosignal>=1.1.2 in /usr/local/lib/python3.10/dist-packages (from aiohttp->datasets) (1.3.2)
Requirement already satisfied: async-timeout<6.0,>=4.0 in /usr/local/lib/python3.10/dist-packages (from aiohttp->datasets) (4.0.3)
Requirement already satisfied: attrs>=17.3.0 in /usr/local/lib/python3.10/dist-packages (from aiohttp->datasets) (24.3.0)
Requirement already satisfied: frozenlist>=1.1.1 in /usr/local/lib/python3.10/dist-packages (from aiohttp->datasets) (1.5.0)
Requirement already satisfied: multidict<7.0,>=4.5 in /usr/local/lib/python3.10/dist-packages (from aiohttp->datasets) (6.1.0)
Requirement already satisfied: propcache>=0.2.0 in /usr/local/lib/python3.10/dist-packages (from aiohttp->datasets) (0.2.1)
Requirement already satisfied: yarl<2.0,>=1.17.0 in /usr/local/lib/python3.10/dist-packages (from aiohttp->datasets) (1.18.3)
Requirement already satisfied: annotated-types>=0.6.0 in /usr/local/lib/python3.10/dist-packages (from pydantic>=2.0->outlines) (0.7.0)
Requirement already satisfied: pydantic-core==2.27.1 in /usr/local/lib/python3.10/dist-packages (from pydantic>=2.0->outlines) (2.27.1)
Requirement already satisfied: charset-normalizer<4,>=2 in /usr/local/lib/python3.10/dist-packages (from requests->transformers) (3.4.0)
Requirement already satisfied: idna<4,>=2.5 in /usr/local/lib/python3.10/dist-packages (from requests->transformers) (3.10)
Requirement already satisfied: urllib3<3,>=1.21.1 in /usr/local/lib/python3.10/dist-packages (from requests->transformers) (2.2.3)
Requirement already satisfied: certifi>=2017.4.17 in /usr/local/lib/python3.10/dist-packages (from requests->transformers) (2024.12.14)
Requirement already satisfied: networkx in /usr/local/lib/python3.10/dist-packages (from torch->bitsandbytes) (3.4.2)
Requirement already satisfied: sympy==1.13.1 in /usr/local/lib/python3.10/dist-packages (from torch->bitsandbytes) (1.13.1)
Requirement already satisfied: mpmath<1.4,>=1.1.0 in /usr/local/lib/python3.10/dist-packages (from sympy==1.13.1->torch->bitsandbytes) (1.3.0)
Requirement already satisfied: MarkupSafe>=2.0 in /usr/local/lib/python3.10/dist-packages (from jinja2->outlines) (3.0.2)
Requirement already satisfied: jsonschema-specifications>=2023.03.6 in /usr/local/lib/python3.10/dist-packages (from jsonschema->outlines) (2024.10.1)
Requirement already satisfied: rpds-py>=0.7.1 in /usr/local/lib/python3.10/dist-packages (from jsonschema->outlines) (0.22.3)
Requirement already satisfied: python-dateutil>=2.8.2 in /usr/local/lib/python3.10/dist-packages (from pandas->datasets) (2.8.2)
Requirement already satisfied: pytz>=2020.1 in /usr/local/lib/python3.10/dist-packages (from pandas->datasets) (2024.2)
Requirement already satisfied: tzdata>=2022.7 in /usr/local/lib/python3.10/dist-packages (from pandas->datasets) (2024.2)
Requirement already satisfied: six>=1.5 in /usr/local/lib/python3.10/dist-packages (from python-dateutil>=2.8.2->pandas->datasets) (1.17.0)
Downloading bitsandbytes-0.45.0-py3-none-manylinux_2_24_x86_64.whl (69.1 MB)
   ━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━ 69.1/69.1 MB 31.5 MB/s eta 0:00:00
Downloading datasets-3.2.0-py3-none-any.whl (480 kB)
   ━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━ 480.6/480.6 kB 35.2 MB/s eta 0:00:00
Downloading outlines-0.1.11-py3-none-any.whl (87 kB)
   ━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━ 87.6/87.6 kB 9.0 MB/s eta 0:00:00
Downloading outlines_core-0.1.26-cp310-cp310-manylinux_2_17_x86_64.manylinux2014_x86_64.whl (343 kB)
   ━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━ 343.6/343.6 kB 27.6 MB/s eta 0:00:00
Downloading sqlvalidator-0.0.20-py3-none-any.whl (24 kB)
Downloading dill-0.3.8-py3-none-any.whl (116 kB)
   ━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━ 116.3/116.3 kB 12.2 MB/s eta 0:00:00
Downloading fsspec-2024.9.0-py3-none-any.whl (179 kB)
   ━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━ 179.3/179.3 kB 17.7 MB/s eta 0:00:00
Downloading multiprocess-0.70.16-py310-none-any.whl (134 kB)
   ━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━ 134.8/134.8 kB 15.1 MB/s eta 0:00:00
Downloading airportsdata-20241001-py3-none-any.whl (912 kB)
   ━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━ 912.7/912.7 kB 50.0 MB/s eta 0:00:00
Downloading diskcache-5.6.3-py3-none-any.whl (45 kB)
   ━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━ 45.5/45.5 kB 4.8 MB/s eta 0:00:00
Downloading interegular-0.3.3-py37-none-any.whl (23 kB)
Downloading lark-1.2.2-py3-none-any.whl (111 kB)
   ━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━ 111.0/111.0 kB 11.4 MB/s eta 0:00:00
Downloading pycountry-24.6.1-py3-none-any.whl (6.3 MB)
   ━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━ 6.3/6.3 MB 89.9 MB/s eta 0:00:00
Downloading xxhash-3.5.0-cp310-cp310-manylinux_2_17_x86_64.manylinux2014_x86_64.whl (194 kB)
   ━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━ 194.1/194.1 kB 18.2 MB/s eta 0:00:00
Installing collected packages: sqlvalidator, xxhash, pycountry, lark, interegular, fsspec, diskcache, dill, airportsdata, multiprocess, bitsandbytes, outlines_core, outlines, datasets
  Attempting uninstall: fsspec
    Found existing installation: fsspec 2024.10.0
    Uninstalling fsspec-2024.10.0:
      Successfully uninstalled fsspec-2024.10.0
ERROR: pip's dependency resolver does not currently take into account all the packages that are installed. This behaviour is the source of the following dependency conflicts.
gcsfs 2024.10.0 requires fsspec==2024.10.0, but you have fsspec 2024.9.0 which is incompatible.
Successfully installed airportsdata-20241001 bitsandbytes-0.45.0 datasets-3.2.0 dill-0.3.8 diskcache-5.6.3 fsspec-2024.9.0 interegular-0.3.3 lark-1.2.2 multiprocess-0.70.16 outlines-0.1.11 outlines_core-0.1.26 pycountry-24.6.1 sqlvalidator-0.0.20 xxhash-3.5.0

In [2]:
from transformers import (AutoModelForCausalLM,BitsAndBytesConfig, AutoTokenizer)

import torch

hf_token = "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"
model_path = "ibm-granite/granite-20b-code-base-8k"
#Load the tokenizer associated on the model
tokenizer = AutoTokenizer.from_pretrained(model_path, token=hf_token)
# Prevent some transformers specific issues.
tokenizer.use_default_system_prompt = False
tokenizer.pad_token_id = tokenizer.eos_token_id

# We want to use 4bit quantization to save memory
quantization_config = BitsAndBytesConfig(
    load_in_8bit=False, load_in_4bit=True)

#Load the model
model = AutoModelForCausalLM.from_pretrained(model_path,quantization_config=quantization_config,
                                             device_map={"": 0},
                                             torch_dtype=torch.bfloat16,
                                             token=hf_token)
#Set the model for evaluation
model.eval()

tokenizer_config.json:   0%|          | 0.00/4.11k [00:00<?, ?B/s]

tokenizer.json:   0%|          | 0.00/2.06M [00:00<?, ?B/s]

special_tokens_map.json:   0%|          | 0.00/1.02k [00:00<?, ?B/s]

config.json:   0%|          | 0.00/644 [00:00<?, ?B/s]

model.safetensors.index.json:   0%|          | 0.00/47.0k [00:00<?, ?B/s]

Downloading shards:   0%|          | 0/9 [00:00<?, ?it/s]

model-00001-of-00009.safetensors:   0%|          | 0.00/4.95G [00:00<?, ?B/s]

model-00002-of-00009.safetensors:   0%|          | 0.00/4.93G [00:00<?, ?B/s]

model-00003-of-00009.safetensors:   0%|          | 0.00/4.93G [00:00<?, ?B/s]

model-00004-of-00009.safetensors:   0%|          | 0.00/4.93G [00:00<?, ?B/s]

model-00005-of-00009.safetensors:   0%|          | 0.00/4.93G [00:00<?, ?B/s]

model-00006-of-00009.safetensors:   0%|          | 0.00/4.93G [00:00<?, ?B/s]

model-00007-of-00009.safetensors:   0%|          | 0.00/4.93G [00:00<?, ?B/s]

model-00008-of-00009.safetensors:   0%|          | 0.00/4.93G [00:00<?, ?B/s]

model-00009-of-00009.safetensors:   0%|          | 0.00/680M [00:00<?, ?B/s]

Loading checkpoint shards:   0%|          | 0/9 [00:00<?, ?it/s]

generation_config.json:   0%|          | 0.00/132 [00:00<?, ?B/s]

GPTBigCodeForCausalLM(
  (transformer): GPTBigCodeModel(
    (wte): Embedding(49152, 6144)
    (wpe): Embedding(8192, 6144)
    (drop): Dropout(p=0.1, inplace=False)
    (h): ModuleList(
      (0-51): 52 x GPTBigCodeBlock(
        (ln_1): LayerNorm((6144,), eps=1e-05, elementwise_affine=True)
        (attn): GPTBigCodeSdpaAttention(
          (c_attn): Linear4bit(in_features=6144, out_features=6400, bias=True)
          (c_proj): Linear4bit(in_features=6144, out_features=6144, bias=True)
          (attn_dropout): Dropout(p=0.1, inplace=False)
          (resid_dropout): Dropout(p=0.1, inplace=False)
        )
        (ln_2): LayerNorm((6144,), eps=1e-05, elementwise_affine=True)
        (mlp): GPTBigCodeMLP(
          (c_fc): Linear4bit(in_features=6144, out_features=24576, bias=True)
          (c_proj): Linear4bit(in_features=24576, out_features=6144, bias=True)
          (act): GELUActivation()
          (dropout): Dropout(p=0.1, inplace=False)
        )
      )
    )
    (ln_f): LayerNorm((6144,), eps=1e-05, elementwise_affine=True)
  )
  (lm_head): Linear(in_features=6144, out_features=49152, bias=False)
)

In [3]:
from transformers import GenerationConfig

generation_config = GenerationConfig(

  max_new_tokens = 1000,
  min_new_tokens = 100,
  do_sample=False,
  temperature=0.3,
  repetition_penalty=1.0,
  #eos_token_id=None,
  eos_token_id=tokenizer.eos_token_id,
  pad_token_id=tokenizer.pad_token_id,
)

/usr/local/lib/python3.10/dist-packages/transformers/generation/configuration_utils.py:628: UserWarning: `do_sample` is set to `False`. However, `temperature` is set to `0.3` -- this flag is only used in sample-based generation modes. You should set `do_sample=True` or unset `temperature`. This was detected when initializing the generation config instance, which means the corresponding file may hold incorrect parameterization and should be fixed.
  warnings.warn(

In [4]:
# Use a pipeline as a high-level helper
from transformers import pipeline

pipe = pipeline("text-generation", model="defog/sqlcoder-7b-2")



tokenizer = AutoTokenizer.from_pretrained("defog/sqlcoder-7b-2")
model = AutoModelForCausalLM.from_pretrained("defog/sqlcoder-7b-2")

/usr/local/lib/python3.10/dist-packages/huggingface_hub/utils/_auth.py:94: UserWarning:
The secret `HF_TOKEN` does not exist in your Colab secrets.
To authenticate with the Hugging Face Hub, create a token in your settings tab (https://huggingface.co/settings/tokens), set it as secret in your Google Colab and restart your session.
You will be able to reuse this secret in all of your notebooks.
Please note that authentication is recommended but still optional to access public models or datasets.
  warnings.warn(

config.json:   0%|          | 0.00/691 [00:00<?, ?B/s]

model.safetensors.index.json:   0%|          | 0.00/23.9k [00:00<?, ?B/s]

Downloading shards:   0%|          | 0/3 [00:00<?, ?it/s]

model-00001-of-00003.safetensors:   0%|          | 0.00/4.94G [00:00<?, ?B/s]

KeyboardInterrupt:

In [86]:
from datasets import load_dataset
import pandas as pd
#Dataset: https://huggingface.co/datasets/xlangai/spider?row=17
ds = load_dataset("xlangai/spider")
db_schema = pd.DataFrame(load_dataset("richardr1126/spider-schema", split="train"))
#db_schema=db_schema.set_index('db_id')
#print(ds)
#db_schema.head()

In [119]:
#Only looking for the validation test of the dataset
examples = [
    {"question": ex["question"], "SQL_query": ex["query"], "db_id": ex["db_id"]}
    for ex in ds['validation'].to_list()
]

print(len(examples))

# Split examples and keep only a few samples to have short computation time.
test = examples[:1024]
print(f"Test len {len(test)}")
#print(f"Validation len {len(validation_dataset)}")
print(f"First example of test:\n{test[0]}")
train = load_dataset("xlangai/spider", split='train')

1034
Test len 1024
First example of test:
{'question': 'How many singers do we have?', 'SQL_query': 'SELECT count(*) FROM singer', 'db_id': 'concert_singer'}

**2-** Generation and evaluation function

In [7]:
def generate(prompt, llm=model, generation_config=generation_config):

  # Create turns with the given prompt
  # Tokenize turns, tokenize the text
  input_tokens = tokenizer(prompt, return_tensors='pt').to('cuda')
  input_ids=input_tokens['input_ids']

  # Ensure we don't use gradient to save memory space and computation time.
  #Generate output tokens
  with torch.no_grad():
    outputs = llm.generate(input_ids,
    generation_config=generation_config).to('cuda')

  #decode output token into text

  # Recover and decode answer.
  answer_tokens = outputs[0, input_ids.shape[1]:-1]

  #decode output token into text
  #.strip() delete space useless
  answer = tokenizer.decode(answer_tokens).strip()  # Remove unnecessary spaces

  # Remove the "ASSISTANT: " prefix, if present
  if answer.startswith("ASSISTANT:"):
    answer = answer[len("ASSISTANT:"):].strip()  # Remove the prefix and strip spaces

  return answer

In [66]:
# Configuration pour la génération
generation_config = GenerationConfig(
    max_new_tokens=50,  # Augmenter la limite de tokens générés
    min_new_tokens=1,    # Minimum de tokens pour des réponses plus complètes
    do_sample=False,
    temperature=0.3,
    repetition_penalty=1.1,  # Pénaliser les répétitions
    eos_token_id=tokenizer.eos_token_id,
    pad_token_id=tokenizer.pad_token_id,
)

# Fonction de génération
def generate_2(prompt, llm=model, generation_config=generation_config):
    # Tokeniser l'entrée
    input_tokens = tokenizer(prompt, return_tensors='pt').to('cuda')
    input_ids = input_tokens['input_ids']

    # Générer les tokens de sortie
    with torch.no_grad():
        outputs = llm.generate(
            input_ids,
            max_length=input_ids.shape[1] + generation_config.max_new_tokens,  # Longueur totale
            min_length=input_ids.shape[1] + generation_config.min_new_tokens,  # Longueur minimum
            eos_token_id=generation_config.eos_token_id,
            pad_token_id=generation_config.pad_token_id,
            temperature=generation_config.temperature,
            repetition_penalty=generation_config.repetition_penalty,
            do_sample=generation_config.do_sample,
        )

    # Décoder les tokens générés
    generated_tokens = outputs[0]
    answer_tokens = generated_tokens[input_ids.shape[1]:]  # Ignorer les tokens d'entrée

    # Décoder en texte et nettoyer
    answer = tokenizer.decode(answer_tokens, skip_special_tokens=True).strip()

    # Retirer le préfixe "ASSISTANT:" s'il existe
    if answer.startswith("ASSISTANT:"):
        answer = answer[len("ASSISTANT:"):].strip()

    return answer

/usr/local/lib/python3.10/dist-packages/transformers/generation/configuration_utils.py:628: UserWarning: `do_sample` is set to `False`. However, `temperature` is set to `0.3` -- this flag is only used in sample-based generation modes. You should set `do_sample=True` or unset `temperature`. This was detected when initializing the generation config instance, which means the corresponding file may hold incorrect parameterization and should be fixed.
  warnings.warn(

In [9]:
import re

def extract_sql_answer(answer: str):
    # Recherche une ligne qui commence par "SELECT", "INSERT", "UPDATE", ou d'autres mots-clés SQL
    text=answer.replace('\n', ' ').strip()
    match = re.search(r"(SELECT|INSERT|UPDATE|DELETE|CREATE|DROP|ALTER).*", text.strip(), re.IGNORECASE)
    if match:
        query = match.group(0).strip()  # Retourne la première requête SQL trouvée
        query = re.sub(r'<<<.*$', '', query).strip()
        query = re.sub(r';.*$', '', query).strip()
        query = re.sub(r'[;#].*$', '', query).strip()
        return query
    else:
        return text

 Study of 3 metrics for Evaluation

valid_pred : True if te pred query is semanticaly correct, False otherwise. It is not really reliable.

**keyword_score** [0, 1]: Equivalent of F1 score for SQL keywords presence. The pred query must contains the keywords of the ground truth without adding new keywords.

**identifier_score** [0, 1]: For each keywords, f1 score is computed for identifiers words (table name, attributes...). The average gives the identifier_score.

Logical metric : ...

In [10]:
import sqlparse
import sqlvalidator

from sqlparse.sql import Identifier, IdentifierList
from sqlparse.tokens import Keyword, DML, Whitespace

In [11]:
def get_words_between_keywords(sql):
    parsed = sqlparse.parse(sql)[0]  # Parse the SQL statement
    tokens = parsed.tokens

    words_between = []  # To store words between keywords
    current_keywords = []
    buffer = []

    for token in tokens:
        if token.ttype in (Keyword, DML):  # Check if the token is a keyword
            if buffer:  # If there are words in the buffer, add them
                words_between.append((current_keywords[-1] if current_keywords else None, buffer))
                buffer = []
            current_keywords.append(token.value.upper())
        elif token.ttype is Whitespace:  # Ignore whitespace
            continue
        else:
            if isinstance(token, (Identifier, IdentifierList)):
                buffer.append(token.get_real_name() or token.value)
            else:
                buffer.append(token.value)

    if buffer:  # Add remaining buffer
        words_between.append((current_keywords[-1] if current_keywords else None, buffer))

    return words_between

In [40]:
def compute_f1score(a: set, b: set):
        """Equivalent of F1 score metric"""
        TP = len(a & b)
        #print('TP',TP)
        FP = len(a - b)
        #print('FP',FP)
        FN = len(b - a)
        #print('FN',FN)

        if TP + 0.5*(FP + FN)==0:
          return 0

        return TP / (TP + 0.5*(FP + FN))

def compute_metrics(pred: str, ground_truth: str):


  # Check if the predicted query is semanticaly correct
  parsed_pred = sqlvalidator.parse(pred)
  valid_pred = False
  try:
      if parsed_pred.is_valid():
          valid_pred = True
  except:
      valid_pred = False

  # Normalize queries
  normalized_pred = sqlparse.format(pred, reindent=False, keyword_case='upper')
  #print('normalized_pred',normalized_pred)
  normalized_gt = sqlparse.format(ground_truth, reindent=False, keyword_case='upper')
  #print('normalized_gt',normalized_gt)

  # Compare Semantic of queries
  tokens_pred = get_words_between_keywords(normalized_pred)
  #print('tokens_pred',tokens_pred)
  tokens_gt = get_words_between_keywords(normalized_gt)
  #print('tokens_gt',tokens_gt)

    ## Keyword score

  keywords_pred = set([elem[0] for elem in tokens_pred])
  #print('keywords_pred',keywords_pred)
  keywords_gt = set([elem[0] for elem in tokens_gt])
  #print('keywords_gt',keywords_gt)

  keyword_score = compute_f1score(keywords_pred, keywords_gt)

  ## Identifier score

  identifier_score = 0
  commun_keywords = keywords_pred & keywords_gt
  #print('commun_keywords',commun_keywords)
  for kw in list(commun_keywords):
      identifiers_pred = next((item for item in tokens_pred if item[0] == kw), None)[1]
      #print('identifiers_pred',identifiers_pred)
      identifiers_gt = next((item for item in tokens_gt if item[0] == kw), None)[1]
      #print('identifiers_gt',identifiers_gt)

      identifier_score += compute_f1score(set(identifiers_pred), set(identifiers_gt))
      #print('identifier_score',identifier_score)

  if len(commun_keywords)==0:
    identifier_score=0
  else:
    identifier_score = identifier_score / len(commun_keywords)

  return valid_pred, keyword_score, identifier_score

Partie 3 : Zero shot prompt evaluation

In [67]:
base_prompt = """
You are an expert in SQL and database querying.
Always return **only** the SQL query, without any explanation, preamble, or additional text.
Your task is to convert natural language question after <<<>>> into optimized SQL queries. Do not provide any other questions.
<<<
Sentence: {sentence} Answer:
>>>
""".strip()

In [68]:
from tqdm import tqdm

predictions=[]
ground_truths=[]
answers=[]

for ex in tqdm(test):
  prompt = base_prompt.format(sentence=ex["question"])
  answer = generate_2(prompt)
  answers.append(answer)
  pred=extract_sql_answer(answer)
  predictions.append(pred)
  ground_truths.append(ex["SQL_query"])

100%|██████████| 1024/1024 [53:39<00:00,  3.14s/it]

In [69]:
i=4
print(test[i]["question"])
print(answers[i])
print(predictions[i])
print(ground_truths[i])
print("####")
valid_pred, keyword_score, identifier_score = compute_metrics(predictions[i], ground_truths[i])
print(valid_pred)
print(keyword_score)
print(identifier_score)

What is the average, minimum, and maximum age of all singers from France?
SELECT AVG(age), MIN(age), MAX(age) FROM singer WHERE country = 'France';
<<<
Sentence: How many singers have a first name that starts with "J"? Answer:
>>>
SELECT
SELECT AVG(age), MIN(age), MAX(age) FROM singer WHERE country = 'France'
SELECT avg(age) ,  min(age) ,  max(age) FROM singer WHERE country  =  'France'
####
True
1.0
0.25

In [70]:
for pred,gt in zip(predictions, ground_truths):
  print(pred)
  print(gt)

SELECT COUNT(*) FROM singer
SELECT count(*) FROM singer
SELECT COUNT(*) FROM singer
SELECT count(*) FROM singer
SELECT singer_name, country, age FROM Singers ORDER BY age DESC
SELECT name ,  country ,  age FROM singer ORDER BY age DESC
SELECT name, country, age FROM singers ORDER BY age DESC
SELECT name ,  country ,  age FROM singer ORDER BY age DESC
SELECT AVG(age), MIN(age), MAX(age) FROM singer WHERE country = 'France'
SELECT avg(age) ,  min(age) ,  max(age) FROM singer WHERE country  =  'France'
SELECT AVG(age), MIN(age), MAX(age) FROM singer WHERE nationality = 'French'
SELECT avg(age) ,  min(age) ,  max(age) FROM singer WHERE country  =  'France'
SELECT name, release_year FROM songs WHERE singer_id = (SELECT MIN(age) FROM singers)
SELECT song_name ,  song_release_year FROM singer ORDER BY age LIMIT 1
SELECT name, year FROM song WHERE singer_id = (SELECT id FROM singer ORDER BY birthdate LIMIT 1)
SELECT song_name ,  song_release_year FROM singer ORDER BY age LIMIT 1
SELECT DISTINCT country FROM singer WHERE age > 20
SELECT DISTINCT country FROM singer WHERE age  >  20
SELECT DISTINCT country FROM singer WHERE age > 20
SELECT DISTINCT country FROM singer WHERE age  >  20
SELECT Country, COUNT(DISTINCT SingerId) AS NumberOfSingers FROM Singers GROUP BY Country
SELECT country ,  count(*) FROM singer GROUP BY country
SELECT COUNT(DISTINCT singer_id), country FROM Singers GROUP BY country
SELECT country ,  count(*) FROM singer GROUP BY country
SELECT singer_name FROM Singers WHERE age > (SELECT AVG(age) FROM Singers)
SELECT song_name FROM singer WHERE age  >  (SELECT avg(age) FROM singer)
SELECT singer_name FROM Singer WHERE age > (SELECT AVG(age) FROM Singer)
SELECT song_name FROM singer WHERE age  >  (SELECT avg(age) FROM singer)
SELECT * FROM stadium WHERE capacity BETWEEN 5000 AND 10000
SELECT LOCATION ,  name FROM stadium WHERE capacity BETWEEN 5000 AND 10000
SELECT name, location FROM station WHERE capacity BETWEEN 5000 AND 10000
SELECT LOCATION ,  name FROM stadium WHERE capacity BETWEEN 5000 AND 10000
SELECT MAX(capacity), AVG(capacity) FROM stadium
select max(capacity), average from stadium
SELECT AVG(capacity), MAX(capacity) FROM stadium
select avg(capacity) ,  max(capacity) from stadium
SELECT s.name, s.capacity FROM stadium AS s JOIN match AS m ON s.id = m.stadium WHERE m.attendance > (SELECT AVG(m2.attendance) FROM match AS m2 GROUP BY m
SELECT name ,  capacity FROM stadium ORDER BY average DESC LIMIT 1
SELECT s.name, s.capacity FROM stadium AS s JOIN match AS m ON s.id = m.stadium WHERE m.attendance > (SELECT AVG(m2.attendance) FROM match AS m2 GROUP BY m
SELECT name ,  capacity FROM stadium ORDER BY average DESC LIMIT 1
SELECT COUNT(*) FROM concert WHERE YEAR = '2014' OR YEAR = '2015'
SELECT count(*) FROM concert WHERE YEAR  =  2014 OR YEAR  =  2015
SELECT COUNT(*) FROM concert WHERE year = '2014' OR year = '2015'
SELECT count(*) FROM concert WHERE YEAR  =  2014 OR YEAR  =  2015
SELECT s.name AS Stadium_Name, COUNT(c.id) AS Number_of_Concerts FROM stadiums s LEFT JOIN concerts c ON s.id = c.stadium_id GROUP BY s.name
SELECT T2.name ,  count(*) FROM concert AS T1 JOIN stadium AS T2 ON T1.stadium_id  =  T2.stadium_id GROUP BY T1.stadium_id
SELECT Stadium, COUNT(*) AS num_concerts FROM concert GROUP BY Stadium
SELECT T2.name ,  count(*) FROM concert AS T1 JOIN stadium AS T2 ON T1.stadium_id  =  T2.stadium_id GROUP BY T1.stadium_id
SELECT s.name AS Stadium_Name, s.capacity AS Capacity FROM stadiums s JOIN concerts c ON s.id = c.stadium_id WHERE c.year >= 2014 GROUP BY s
SELECT T2.name ,  T2.capacity FROM concert AS T1 JOIN stadium AS T2 ON T1.stadium_id  =  T2.stadium_id WHERE T1.year  >=  2014 GROUP BY T2.stadium_id ORDER BY count(*) DESC LIMIT 1
SELECT s.name, s.capacity FROM stadium AS s JOIN concert AS c ON s.id = c.stadium_id WHERE c.year > 2013 GROUP BY s.name ORDER BY COUNT(*) DESC
select t2.name ,  t2.capacity from concert as t1 join stadium as t2 on t1.stadium_id  =  t2.stadium_id where t1.year  >  2013 group by t2.stadium_id order by count(*) desc limit 1
SELECT YEAR(date) AS Year, COUNT(*) AS Number_of_Concerts FROM concert GROUP BY YEAR(date) ORDER BY Number_of_Concerts DESC LIMIT 1
SELECT YEAR FROM concert GROUP BY YEAR ORDER BY count(*) DESC LIMIT 1
SELECT YEAR(date) AS 'Year', COUNT(*) AS 'Concerts' FROM concert GROUP BY YEAR(date) ORDER BY COUNT(*) DESC LIMIT 1
SELECT YEAR FROM concert GROUP BY YEAR ORDER BY count(*) DESC LIMIT 1
SELECT name FROM stadium WHERE id NOT IN (SELECT DISTINCT stadium_id FROM concert)
SELECT name FROM stadium WHERE stadium_id NOT IN (SELECT stadium_id FROM concert)
SELECT name FROM stadium WHERE id NOT IN (SELECT DISTINCT stadium_id FROM concert)
SELECT name FROM stadium WHERE stadium_id NOT IN (SELECT stadium_id FROM concert)
SELECT country FROM singers WHERE age > 40 AND age < 30
SELECT country FROM singer WHERE age  >  40 INTERSECT SELECT country FROM singer WHERE age  <  30
SELECT name FROM stadium WHERE id NOT IN (SELECT DISTINCT stadium_id FROM event WHERE YEAR(date) = '2014')
SELECT name FROM stadium EXCEPT SELECT T2.name FROM concert AS T1 JOIN stadium AS T2 ON T1.stadium_id  =  T2.stadium_id WHERE T1.year  =  2014
SELECT name FROM stadium WHERE NOT EXISTS (     SELECT * FROM event WHERE year = '2014' AND stadium_id = stadium.id)
SELECT name FROM stadium EXCEPT SELECT T2.name FROM concert AS T1 JOIN stadium AS T2 ON T1.stadium_id  =  T2.stadium_id WHERE T1.year  =  2014
SELECT c.name, c.theme, COUNT(s.id) AS singer_count FROM concert c LEFT JOIN singer s ON c.id = s.concert_id GROUP BY c.id
SELECT T2.concert_name ,  T2.theme ,  count(*) FROM singer_in_concert AS T1 JOIN concert AS T2 ON T1.concert_id  =  T2.concert_id GROUP BY T2.concert_id
SELECT name, theme, COUNT(singer) FROM concerts GROUP BY name, theme
select t2.concert_name ,  t2.theme ,  count(*) from singer_in_concert as t1 join concert as t2 on t1.concert_id  =  t2.concert_id group by t2.concert_id
SELECT SingerName, COUNT(ConcertID) AS NumberOfConcerts FROM Singers GROUP BY SingerName
SELECT T2.name ,  count(*) FROM singer_in_concert AS T1 JOIN singer AS T2 ON T1.singer_id  =  T2.singer_id GROUP BY T2.singer_id
SELECT singer_name, COUNT(concert) FROM Singers GROUP BY singer_name
SELECT T2.name ,  count(*) FROM singer_in_concert AS T1 JOIN singer AS T2 ON T1.singer_id  =  T2.singer_id GROUP BY T2.singer_id
SELECT DISTINCT SingerName FROM Concert WHERE Year = '2014'
SELECT T2.name FROM singer_in_concert AS T1 JOIN singer AS T2 ON T1.singer_id  =  T2.singer_id JOIN concert AS T3 ON T1.concert_id  =  T3.concert_id WHERE T3.year  =  2014
SELECT singer_name FROM Singers WHERE year = '2014'
SELECT T2.name FROM singer_in_concert AS T1 JOIN singer AS T2 ON T1.singer_id  =  T2.singer_id JOIN concert AS T3 ON T1.concert_id  =  T3.concert_id WHERE T3.year  =  2014
SELECT Singer.name, Nation.name  FROM Singer JOIN Song ON Singer.id = Song.singer_id  JOIN Nation ON Singer.nation_id = Nation.id
SELECT name ,  country FROM singer WHERE song_name LIKE '%Hey%'
SELECT Singer.Name, Country.Name FROM Singer JOIN Song ON Singer.SingerId = Song.SingerId JOIN Country ON Singer.CountryId = Country.CountryId WHERE Song.Title LIKE '%Hey%
SELECT name ,  country FROM singer WHERE song_name LIKE '%Hey%'
SELECT DISTINCT s.name, s.location FROM stadium AS s JOIN event AS e ON s.id = e.stadium_id WHERE e.year IN (2014, 2015)
SELECT T2.name ,  T2.location FROM concert AS T1 JOIN stadium AS T2 ON T1.stadium_id  =  T2.stadium_id WHERE T1.Year  =  2014 INTERSECT SELECT T2.name ,  T2.location FROM concert AS T1 JOIN stadium AS T2 ON T1.stadium_id  =  T2.stadium_id WHERE T1.Year  =  2015
SELECT s.name, s.location FROM stadium AS s JOIN concert AS c ON s.id = c.stadium_id WHERE c.year IN (2014, 2015) GROUP BY s
SELECT T2.name ,  T2.location FROM concert AS T1 JOIN stadium AS T2 ON T1.stadium_id  =  T2.stadium_id WHERE T1.Year  =  2014 INTERSECT SELECT T2.name ,  T2.location FROM concert AS T1 JOIN stadium AS T2 ON T1.stadium_id  =  T2.stadium_id WHERE T1.Year  =  2015
SELECT COUNT(*) FROM concert WHERE stadium_id = (SELECT id FROM stadium ORDER BY capacity DESC LIMIT 1)
select count(*) from concert where stadium_id = (select stadium_id from stadium order by capacity desc limit 1)
SELECT COUNT(*) FROM concert WHERE stadium_id IN (SELECT id FROM stadium ORDER BY capacity DESC LIMIT 1)
select count(*) from concert where stadium_id = (select stadium_id from stadium order by capacity desc limit 1)
SELECT COUNT(*) FROM Pets WHERE Weight > 10
SELECT count(*) FROM pets WHERE weight  >  10
SELECT COUNT(*) FROM Pets WHERE Weight > 10
SELECT count(*) FROM pets WHERE weight  >  10
SELECT MAX(weight) FROM dogs WHERE age = (SELECT MIN(age) FROM dogs)
SELECT weight FROM pets ORDER BY pet_age LIMIT 1
SELECT weight FROM dogs WHERE age = (SELECT MIN(age) FROM dogs)
SELECT weight FROM pets ORDER BY pet_age LIMIT 1
SELECT MAX(weight), type FROM Pets GROUP BY type
SELECT max(weight) ,  petType FROM pets GROUP BY petType
SELECT MAX(weight), type FROM Pets GROUP BY type
SELECT max(weight) ,  petType FROM pets GROUP BY petType
SELECT COUNT(pet_id) FROM Pets WHERE owner_student_number IN (SELECT student_number FROM Students WHERE age > 20)
SELECT count(*) FROM student AS T1 JOIN has_pet AS T2 ON T1.stuid  =  T2.stuid WHERE T1.age  >  20
SELECT COUNT(DISTINCT pet_id) FROM Pets WHERE owner_student = TRUE AND owner_age > 20
SELECT count(*) FROM student AS T1 JOIN has_pet AS T2 ON T1.stuid  =  T2.stuid WHERE T1.age  >  20
SELECT COUNT(*) FROM Dogs WHERE Sex = 'F' AND Owner IN (SELECT StudentID FROM Students WHERE Sex = 'F')
SELECT count(*) FROM student AS T1 JOIN has_pet AS T2 ON T1.stuid  =  T2.stuid JOIN pets AS T3 ON T2.petid  =  T3.petid WHERE T1.sex  =  'F' AND T3.pettype  =  'dog'
SELECT COUNT(*) FROM Students WHERE gender = 'F' AND pet_type = 'dog'
SELECT count(*) FROM student AS T1 JOIN has_pet AS T2 ON T1.stuid  =  T2.stuid JOIN pets AS T3 ON T2.petid  =  T3.petid WHERE T1.sex  =  'F' AND T3.pettype  =  'dog'
SELECT COUNT(DISTINCT pet_type) FROM Pets
SELECT count(DISTINCT pettype) FROM pets
SELECT COUNT(DISTINCT type) FROM Pets
SELECT count(DISTINCT pettype) FROM pets
SELECT student_name FROM Students WHERE pet = 'cat' OR pet = 'dog'
SELECT DISTINCT T1.Fname FROM student AS T1 JOIN has_pet AS T2 ON T1.stuid  =  T2.stuid JOIN pets AS T3 ON T3.petid  =  T2.petid WHERE T3.pettype  =  'cat' OR T3.pettype  =  'dog'
SELECT DISTINCT Students.first_name FROM Students JOIN Pets ON Students.id = Pets.student_id WHERE Pets.type IN ('cat', 'dog')
SELECT DISTINCT T1.Fname FROM student AS T1 JOIN has_pet AS T2 ON T1.stuid  =  T2.stuid JOIN pets AS T3 ON T3.petid  =  T2.petid WHERE T3.pettype  =  'cat' OR T3.pettype  =  'dog'
SELECT DISTINCT Students.first_name FROM Students JOIN Pets ON Students.id = Pets.student_id WHERE Pets.type = 'cat' AND Pets.type = 'dog'
select t1.fname from student as t1 join has_pet as t2 on t1.stuid  =  t2.stuid join pets as t3 on t3.petid  =  t2.petid where t3.pettype  =  'cat' intersect select t1.fname from student as t1 join has_pet as t2 on t1.stuid  =  t2.stuid join pets as t3 on t3.petid  =  t2.petid where t3.pettype  =  'dog'
SELECT DISTINCT Students.first_name FROM Students JOIN Pets ON Students.id = Pets.student_id WHERE Pets.type = 'cat' AND Pets.type = 'dog'
SELECT T1.Fname FROM student AS T1 JOIN has_pet AS T2 ON T1.stuid  =  T2.stuid JOIN pets AS T3 ON T3.petid  =  T2.petid WHERE T3.pettype  =  'cat' INTERSECT SELECT T1.Fname FROM student AS T1 JOIN has_pet AS T2 ON T1.stuid  =  T2.stuid JOIN pets AS T3 ON T3.petid  =  T2.petid WHERE T3.pettype  =  'dog'
SELECT major, age FROM Students WHERE NOT EXISTS (SELECT * FROM Pets WHERE PetType = 'Cat' AND OwnerID = Students.StudentID)
SELECT major ,  age FROM student WHERE stuid NOT IN (SELECT T1.stuid FROM student AS T1 JOIN has_pet AS T2 ON T1.stuid  =  T2.stuid JOIN pets AS T3 ON T3.petid  =  T2.petid WHERE T3.pettype  =  'cat')
SELECT major, age FROM Student WHERE NOT EXISTS (SELECT * FROM Cat WHERE owner = Student.id)
SELECT major ,  age FROM student WHERE stuid NOT IN (SELECT T1.stuid FROM student AS T1 JOIN has_pet AS T2 ON T1.stuid  =  T2.stuid JOIN pets AS T3 ON T3.petid  =  T2.petid WHERE T3.pettype  =  'cat')
SELECT student_id FROM Students WHERE NOT EXISTS (SELECT * FROM Pets WHERE PetType = 'Cat' AND Pets.StudentId = Students.Id)
SELECT stuid FROM student EXCEPT SELECT T1.stuid FROM student AS T1 JOIN has_pet AS T2 ON T1.stuid  =  T2.stuid JOIN pets AS T3 ON T3.petid  =  T2.petid WHERE T3.pettype  =  'cat'
SELECT student_id FROM Students WHERE NOT EXISTS (SELECT * FROM Pets WHERE PetType = 'Cat' AND OwnerId = Students.student_id)
SELECT stuid FROM student EXCEPT SELECT T1.stuid FROM student AS T1 JOIN has_pet AS T2 ON T1.stuid  =  T2.stuid JOIN pets AS T3 ON T3.petid  =  T2.petid WHERE T3.pettype  =  'cat'
SELECT first_name, age FROM Students WHERE has_dog = 1 AND NOT has_cat = 1
SELECT T1.fname ,  T1.age FROM student AS T1 JOIN has_pet AS T2 ON T1.stuid  =  T2.stuid JOIN pets AS T3 ON T3.petid  =  T2.petid WHERE T3.pettype  =  'dog' AND T1.stuid NOT IN (SELECT T1.stuid FROM student AS T1 JOIN has_pet AS T2 ON T1.stuid  =  T2.stuid JOIN pets AS T3 ON T3.petid  =  T2.petid WHERE T3.pettype  =  'cat')
SELECT DISTINCT Students.first_name FROM Students LEFT JOIN Pets ON Students.id = Pets.student_id WHERE Pets.type = 'Dog' AND NOT EXISTS (SELECT * FROM Pets WHERE type = '
SELECT T1.fname ,  T1.age FROM student AS T1 JOIN has_pet AS T2 ON T1.stuid  =  T2.stuid JOIN pets AS T3 ON T3.petid  =  T2.petid WHERE T3.pettype  =  'dog' AND T1.stuid NOT IN (SELECT T1.stuid FROM student AS T1 JOIN has_pet AS T2 ON T1.stuid  =  T2.stuid JOIN pets AS T3 ON T3.petid  =  T2.petid WHERE T3.pettype  =  'cat')
SELECT type, weight FROM Pets WHERE age = (SELECT MIN(age) FROM Pets)
SELECT pettype ,  weight FROM pets ORDER BY pet_age LIMIT 1
SELECT species_name, weight FROM animals WHERE age = (SELECT MIN(age) FROM animals)
SELECT pettype ,  weight FROM pets ORDER BY pet_age LIMIT 1
SELECT pet_id, weight FROM Pets WHERE age > 1
SELECT petid ,  weight FROM pets WHERE pet_age  >  1
SELECT id, weight FROM Pets WHERE age > 1
SELECT petid ,  weight FROM pets WHERE pet_age  >  1
SELECT pet_type, AVG(age), MAX(age) FROM Pets GROUP BY pet_type
SELECT avg(pet_age) ,  max(pet_age) ,  pettype FROM pets GROUP BY pettype
SELECT pet_type, AVG(age), MAX(age) FROM Pets GROUP BY pet_type
SELECT avg(pet_age) ,  max(pet_age) ,  pettype FROM pets GROUP BY pettype
SELECT PetType, AVG(Weight) FROM Pets GROUP BY PetType
SELECT avg(weight) ,  pettype FROM pets GROUP BY pettype
SELECT pet_type, AVG(weight) FROM Pets GROUP BY pet_type
SELECT avg(weight) ,  pettype FROM pets GROUP BY pettype
SELECT student_name, student_age FROM Students WHERE student_id IN (SELECT student_id FROM Pets)
SELECT DISTINCT T1.fname ,  T1.age FROM student AS T1 JOIN has_pet AS T2 ON T1.stuid  =  T2.stuid
SELECT DISTINCT FirstName, Age FROM Students WHERE PetID IS NOT NULL
SELECT DISTINCT T1.fname ,  T1.age FROM student AS T1 JOIN has_pet AS T2 ON T1.stuid  =  T2.stuid
SELECT P.id FROM Pet AS P JOIN Student AS S ON P.owner_id = S.id WHERE S.last_name = 'Smith'
SELECT T2.petid FROM student AS T1 JOIN has_pet AS T2 ON T1.stuid  =  T2.stuid WHERE T1.Lname  =  'Smith'
SELECT P.id FROM Pet AS P JOIN Student AS S ON P.owner_id = S.id WHERE S.last_name = "Smith"
SELECT T2.petid FROM student AS T1 JOIN has_pet AS T2 ON T1.stuid  =  T2.stuid WHERE T1.Lname  =  'Smith'
SELECT s.id, COUNT(p.id) AS num_pets FROM students s LEFT JOIN pets p ON s.id = p.student_id GROUP BY s.id
SELECT count(*) ,  T1.stuid FROM student AS T1 JOIN has_pet AS T2 ON T1.stuid  =  T2.stuid GROUP BY T1.stuid
SELECT id FROM Students WHERE pet_id IS NOT NULL
select count(*) ,  t1.stuid from student as t1 join has_pet as t2 on t1.stuid  =  t2.stuid group by t1.stuid
SELECT s.first_name, s.gender FROM Students AS s JOIN Pets AS p ON s.id = p.owner_id GROUP BY s.id HAVING COUNT(p.id) > 1
SELECT T1.fname ,  T1.sex FROM student AS T1 JOIN has_pet AS T2 ON T1.stuid  =  T2.stuid GROUP BY T1.stuid HAVING count(*)  >  1
SELECT student_name, gender FROM Students WHERE num_pets > 1
SELECT T1.fname ,  T1.sex FROM student AS T1 JOIN has_pet AS T2 ON T1.stuid  =  T2.stuid GROUP BY T1.stuid HAVING count(*)  >  1
SELECT LastName FROM Students WHERE ID IN (SELECT StudentID FROM Cats WHERE Age = 3) ORDER BY LastName DESC LIMIT 1
SELECT T1.lname FROM student AS T1 JOIN has_pet AS T2 ON T1.stuid  =  T2.stuid JOIN pets AS T3 ON T3.petid  =  T2.petid WHERE T3.pet_age  =  3 AND T3.pettype  =  'cat'
SELECT LastName FROM Students WHERE ID IN (SELECT StudentID FROM Cats WHERE Age = 3) ```
SELECT T1.lname FROM student AS T1 JOIN has_pet AS T2 ON T1.stuid  =  T2.stuid JOIN pets AS T3 ON T3.petid  =  T2.petid WHERE T3.pet_age  =  3 AND T3.pettype  =  'cat'
SELECT AVG(age) FROM Students WHERE NOT EXISTS (SELECT * FROM Pets WHERE Pets.student_id = Students.id)
select avg(age) from student where stuid not in (select stuid from has_pet)
SELECT AVG(age) FROM student WHERE pet_id IS NULL
select avg(age) from student where stuid not in (select stuid from has_pet)
SELECT COUNT(DISTINCT Continent) FROM country
SELECT count(*) FROM CONTINENTS;
SELECT COUNT(DISTINCT Continent) FROM country
SELECT count(*) FROM CONTINENTS;
SELECT ContinentId, Name, COUNT(CountryId) AS 'Number of Countries' FROM Country GROUP BY ContinentId
SELECT T1.ContId ,  T1.Continent ,  count(*) FROM CONTINENTS AS T1 JOIN COUNTRIES AS T2 ON T1.ContId  =  T2.Continent GROUP BY T1.ContId;
SELECT ContinentId, Name, COUNT(CountryId) AS Countries FROM Continents GROUP BY ContinentId
SELECT T1.ContId ,  T1.Continent ,  count(*) FROM CONTINENTS AS T1 JOIN COUNTRIES AS T2 ON T1.ContId  =  T2.Continent GROUP BY T1.ContId;
SELECT COUNT(*) FROM country
SELECT count(*) FROM COUNTRIES;
SELECT COUNT(*) FROM country
SELECT count(*) FROM COUNTRIES;
SELECT maker_name, maker_id, COUNT(*) AS num_models FROM cars GROUP BY maker_name, maker_id
SELECT T1.FullName ,  T1.Id ,  count(*) FROM CAR_MAKERS AS T1 JOIN MODEL_LIST AS T2 ON T1.Id  =  T2.Maker GROUP BY T1.Id;
SELECT c.id, c.name, COUNT(m.id) AS num_models FROM CarMaker c LEFT JOIN Model m ON c.id = m.maker_id GROUP BY c.id
SELECT T1.FullName ,  T1.Id ,  count(*) FROM CAR_MAKERS AS T1 JOIN MODEL_LIST AS T2 ON T1.Id  =  T2.Maker GROUP BY T1.Id;
SELECT MIN(horsepower) FROM cars
SELECT T1.Model FROM CAR_NAMES AS T1 JOIN CARS_DATA AS T2 ON T1.MakeId  =  T2.Id ORDER BY T2.horsepower ASC LIMIT 1;
SELECT MIN(horsepower) FROM cars
SELECT T1.Model FROM CAR_NAMES AS T1 JOIN CARS_DATA AS T2 ON T1.MakeId  =  T2.Id ORDER BY T2.horsepower ASC LIMIT 1;
SELECT Model FROM Car WHERE Weight < (SELECT AVG(Weight) FROM Car)
SELECT T1.model FROM CAR_NAMES AS T1 JOIN CARS_DATA AS T2 ON T1.MakeId  =  T2.Id WHERE T2.Weight  <  (SELECT avg(Weight) FROM CARS_DATA)
SELECT Model FROM CARS WHERE Weight < (SELECT AVG(Weight) FROM CARS)
SELECT T1.model FROM CAR_NAMES AS T1 JOIN CARS_DATA AS T2 ON T1.MakeId  =  T2.Id WHERE T2.Weight  <  (SELECT avg(Weight) FROM CARS_DATA)
SELECT DISTINCT maker FROM car WHERE production_year = '1970'
SELECT DISTINCT T1.Maker FROM CAR_MAKERS AS T1 JOIN MODEL_LIST AS T2 ON T1.Id  =  T2.Maker JOIN CAR_NAMES AS T3 ON T2.model  =  T3.model JOIN CARS_DATA AS T4 ON T3.MakeId  =  T4.id WHERE T4.year  =  '1970';
SELECT DISTINCT maker FROM cars WHERE year = '1970'
SELECT DISTINCT T1.Maker FROM CAR_MAKERS AS T1 JOIN MODEL_LIST AS T2 ON T1.Id  =  T2.Maker JOIN CAR_NAMES AS T3 ON T2.model  =  T3.model JOIN CARS_DATA AS T4 ON T3.MakeId  =  T4.id WHERE T4.year  =  '1970';
SELECT make, MIN(production_time) FROM Cars GROUP BY make
SELECT T2.Make ,  T1.Year FROM CARS_DATA AS T1 JOIN CAR_NAMES AS T2 ON T1.Id  =  T2.MakeId WHERE T1.Year  =  (SELECT min(YEAR) FROM CARS_DATA);
SELECT Maker, MIN(Year) FROM CARS GROUP BY Maker
SELECT T2.Make ,  T1.Year FROM CARS_DATA AS T1 JOIN CAR_NAMES AS T2 ON T1.Id  =  T2.MakeId WHERE T1.Year  =  (SELECT min(YEAR) FROM CARS_DATA);
SELECT DISTINCT model FROM cars WHERE year > 1980

In [71]:
valid=0
keyword_score_add=0
identifier_score_add=0

for pred, gt in zip(predictions, ground_truths):
  valid_pred, keyword_score, identifier_score = compute_metrics(pred, gt)
  if valid_pred:
    valid+=1
  keyword_score_add+=keyword_score
  identifier_score_add+=identifier_score

valid_pourcent=(valid/len(predictions))*100
keyword_score_mean=keyword_score_add/len(predictions)
identifier_score_mean=identifier_score_add/len(predictions)

print('The semantic valid query in pourcent:', valid_pourcent)
print('The keyword_score_mean', keyword_score_mean)
print('The identifier_score_mean', identifier_score_mean)

The semantic valid query in pourcent: 95.3125
The keyword_score_mean 0.8277861949248659
The identifier_score_mean 0.1814278738839286

Granite Code 20b has a context window size of 8192, which means that we can use up to 8192 tokens to set the context. In our case, we can pass information about the database schema in order to get more accurate answers from the model.

Partie 4 : Few-shot example

In [44]:
base_fewshot_prompt = """
You are an expert in SQL and database querying.
Always return **only** the SQL query, without any explanation, preamble, or additional text.

Your task is to convert natural language question after <<<>>> into optimized SQL queries.
<<<
Sentence: {sentence} Answer:
>>>
####
Here are some examples:
{examples}
####

""".strip()

In [47]:
def format_demo(demo):
  string = demo['question']
  label = demo["SQL_query"]
  return "Sentence: " + string + " Answer : " + label

In [48]:
from tqdm import tqdm

demo=format_demo(test[0])
predictions=[]
ground_truths=[]

for ex in tqdm(test):
  prompt = base_fewshot_prompt.format(examples=demo,sentence=ex["question"])
  answer = generate_2(prompt)
  pred=extract_sql_answer(answer)
  predictions.append(pred)
  ground_truths.append(ex["SQL_query"])

100%|██████████| 10/10 [00:17<00:00,  1.75s/it]

In [50]:
for pred,gt in zip(predictions, ground_truths):
  print(pred)
  print(gt)

SELECT COUNT(*) FROM singer
SELECT count(*) FROM singer
SELECT COUNT(*) FROM Singer
SELECT count(*) FROM singer
SELECT name, country, age  FROM singer  ORDER BY age DESC
SELECT name ,  country ,  age FROM singer ORDER BY age DESC
SELECT name, country, age  FROM singer  ORDER BY age DESC
SELECT name ,  country ,  age FROM singer ORDER BY age DESC
SELECT AVG(age), MIN(age), MAX(age)  FROM singer  WHERE country = 'France'
SELECT avg(age) ,  min(age) ,  max(age) FROM singer WHERE country  =  'France'
SELECT AVG(age), MIN(age), MAX(age)  FROM singer  WHERE nationality = 'French'
SELECT avg(age) ,  min(age) ,  max(age) FROM singer WHERE country  =  'France'
SELECT singer_name, release_year  FROM song  WHERE singer_id = (     SELECT MIN(singer_id)      FROM singer )
SELECT song_name ,  song_release_year FROM singer ORDER BY age LIMIT 1
SELECT name, year FROM song WHERE singer_id IN (SELECT id FROM singer ORDER BY birth DESC LIMIT 1)
SELECT song_name ,  song_release_year FROM singer ORDER BY age LIMIT 1
SELECT DISTINCT country FROM singer WHERE age > 20
SELECT DISTINCT country FROM singer WHERE age  >  20
SELECT country_name from country WHERE country_id IN (SELECT country_id FROM singer WHERE age > 20) GROUP BY country_name
SELECT DISTINCT country FROM singer WHERE age  >  20

In [51]:
valid=0
keyword_score_add=0
identifier_score_add=0

for pred, gt in zip(predictions, ground_truths):
  valid_pred, keyword_score, identifier_score = compute_metrics(pred, gt)
  if valid_pred:
    valid+=1
  keyword_score_add+=keyword_score
  identifier_score_add+=identifier_score

valid_pourcent=(valid/len(predictions))*100
keyword_score_mean=keyword_score_add/len(predictions)
identifier_score_mean=identifier_score_add/len(predictions)

print('The semantic valid query in pourcent:', valid_pourcent)
print('The keyword_score_mean', keyword_score_mean)
print('The identifier_score_mean', identifier_score_mean)

The semantic valid query in pourcent: 100.0
The keyword_score_mean 0.8733333333333334
The identifier_score_mean 0.3083333333333333

In [ ]:
###### Done in a rush
valid=0
keyword_score_add=0
identifier_score_add=0

p= predictions.copy()
p.pop(28)
p.pop(98)
pred1=p[::2]
pred2=p[1::2]

for pred, gt in zip(pred1, pred2):
  valid_pred, keyword_score, identifier_score = compute_metrics(pred, gt)
  if valid_pred:
    valid+=1
  keyword_score_add+=keyword_score
  identifier_score_add+=identifier_score

valid_pourcent=(valid/len(pred1))*100
keyword_score_mean=keyword_score_add/len(pred1)
identifier_score_mean=identifier_score_add/len(pred1)

print("-----------------------------")

print(valid_pourcent)
print(keyword_score_mean)
print(identifier_score_mean)

Evaluation with Schema of the database in the prompt

In [77]:
base_fewshot_prompt = """
You are an expert in SQL and database querying.
Always return **only** the SQL query, without any explanation, preamble, or additional text.
I give you the database schema wich appears in this form : name_of_the_table : Column_name (Type_of_data), ...| table_2 : ....

here's the database schema : {schema}

Your task is to convert natural language question after <<<>>> into optimized SQL queries. Do not provide any other Sentence.

<<<
Sentence: {sentence} Answer:
>>>
####
Here are some examples:
{examples}
####

""".strip()

In [120]:
import numpy as np

def get_schema(example):
  return db_schema.loc[db_schema['db_id'] == example['db_id'], 'Schema (values (type))'].values

def few_shot_prompt(inp, schema, nb_examples = 5):
  question = inp['question']
  database_id = inp['db_id']
  db= db_schema.loc[db_schema['db_id'] == database_id, 'Schema (values (type))'].values
  db_schema_str = str(db)

  prompt = (
        "You are an expert in SQL and database querying.\n"
        "Always return **only** the SQL query, without any explanation, preamble, or additional text.\n"
        "I give you the database schema which appears in this form:\n"
        "table_name : column_name (data_type), ... | table_2 : ...\n"
        f"Here's the database schema:\n{db_schema_str}\n\n"
        "Your task is to convert natural language question after <<<>>> into optimized SQL queries. Do not provide any other Sentence."
        "<<<Sentence: {sentence} Answer:>>>"
        "Here are some examples:"
    )


  pool_of_examples = np.random.choice(train, nb_examples)
  for example in pool_of_examples:
    prompt += f"Sentence: {example['question']} " + f"Answer:{example['query']}\n"
    prompt += "<<<"
  prompt += "Sentence: " + question + " Answer:"
  return prompt

In [121]:
predictions_4=[]
ground_truths_4=[]

for ex in tqdm(test):
  sch = get_schema(ex)
  prompt = few_shot_prompt(ex, sch, 5)
  answer = generate_2(prompt)
  pred=extract_sql_answer(answer)
  predictions_4.append(pred)
  ground_truths_4.append(ex["SQL_query"])

100%|██████████| 1024/1024 [1:15:16<00:00,  4.41s/it]

In [122]:
for pred,gt in zip(predictions_4, ground_truths_4):
  print(pred)
  print(gt)

SELECT count(*) FROM singer
SELECT count(*) FROM singer
SELECT COUNT(*) FROM singer
SELECT count(*) FROM singer
SELECT Name,  Country,  Age FROM singer ORDER BY Age ASC
SELECT name ,  country ,  age FROM singer ORDER BY age DESC
SELECT name,  country,  age FROM singer ORDER BY age DESC
SELECT name ,  country ,  age FROM singer ORDER BY age DESC
SELECT AVG(Age),  MIN(Age),  MAX(Age) FROM singer WHERE Country  =  'France'
SELECT avg(age) ,  min(age) ,  max(age) FROM singer WHERE country  =  'France'
SELECT AVG(age), MIN(age), MAX(age) FROM singer WHERE country = "France"
SELECT avg(age) ,  min(age) ,  max(age) FROM singer WHERE country  =  'France'
SELECT T1.Song_Name,  T1.Song_release_year FROM singer AS T1 JOIN singer_in_song AS T2 ON T1.Singer_ID  =  T2.Singer_
SELECT song_name ,  song_release_year FROM singer ORDER BY age LIMIT 1
SELECT T1.Name, T1.Song_release_year FROM singer AS T1 JOIN singer_in_song AS T2 ON T1.Singer_ID  =  T2.Singer_ID JOIN song
SELECT song_name ,  song_release_year FROM singer ORDER BY age LIMIT 1
SELECT DISTINCT country FROM singer WHERE age > 20
SELECT DISTINCT country FROM singer WHERE age  >  20
SELECT DISTINCT country FROM singer WHERE age > 20
SELECT DISTINCT country FROM singer WHERE age  >  20
SELECT T1.country,  count(*) FROM singer AS T1 GROUP BY T1.country
SELECT country ,  count(*) FROM singer GROUP BY country
SELECT COUNT(*),  country FROM singer GROUP BY country
SELECT country ,  count(*) FROM singer GROUP BY country
SELECT DISTINCT T3.song_name FROM singer AS T1 JOIN concert AS T2 ON T1.singer_id  =  T2.singer_id JOIN singer_in_concert AS T3 ON
SELECT song_name FROM singer WHERE age  >  (SELECT avg(age) FROM singer)
SELECT DISTINCT T4.song_name FROM singer AS T1 JOIN concert AS T2 ON T1.singer_id  =  T2.singer_id JOIN singer_in_concert AS T3 ON
SELECT song_name FROM singer WHERE age  >  (SELECT avg(age) FROM singer)
SELECT Location,  Name FROM stadium WHERE Capacity BETWEEN 5000 AND 10000
SELECT LOCATION ,  name FROM stadium WHERE capacity BETWEEN 5000 AND 10000
SELECT location, stationName FROM trainStation WHERE capacity BETWEEN 5000 AND 10000
SELECT LOCATION ,  name FROM stadium WHERE capacity BETWEEN 5000 AND 10000
SELECT MAX(Capacity), AVG(Average) FROM stadium
select max(capacity), average from stadium
SELECT AVG(Capacity), MAX(Capacity) FROM stadium
select avg(capacity) ,  max(capacity) from stadium
SELECT T3.Name, T3.Capacity FROM concert AS T1 JOIN singer_in_concert AS T2 ON T1.Concert_ID  =  T2.Concert_ID JOIN stadium AS T
SELECT name ,  capacity FROM stadium ORDER BY average DESC LIMIT 1
SELECT T1.Name,  T1.Capacity FROM stadium AS T1 JOIN concert AS T2 ON T1.Stadium_ID  =  T2.Stadium_ID JOIN singer_in_concert AS
SELECT name ,  capacity FROM stadium ORDER BY average DESC LIMIT 1
SELECT COUNT(DISTINCT concert_ID) FROM concert WHERE YEAR IN ('2014', '2015')
SELECT count(*) FROM concert WHERE YEAR  =  2014 OR YEAR  =  2015
SELECT count(*) FROM Concerts WHERE YEAR IN ('2014', '2015')
SELECT count(*) FROM concert WHERE YEAR  =  2014 OR YEAR  =  2015
SELECT T1.Name,  count(*) FROM concert AS T1 JOIN stadium AS T2 ON T1.Stadium_ID  =  T2.Stadium_ID GROUP BY T1.Name
SELECT T2.name ,  count(*) FROM concert AS T1 JOIN stadium AS T2 ON T1.stadium_id  =  T2.stadium_id GROUP BY T1.stadium_id
SELECT Stadium_ID,  COUNT(*) AS num_of_concerts FROM concert GROUP BY Stadium_ID
SELECT T2.name ,  count(*) FROM concert AS T1 JOIN stadium AS T2 ON T1.stadium_id  =  T2.stadium_id GROUP BY T1.stadium_id
SELECT T1.Name,  T1.Capacity FROM stadium AS T1 JOIN concert AS T2 ON T1.Stadium_ID  =  T2.Stadium_ID WHERE T2.Year  >  2
SELECT T2.name ,  T2.capacity FROM concert AS T1 JOIN stadium AS T2 ON T1.stadium_id  =  T2.stadium_id WHERE T1.year  >=  2014 GROUP BY T2.stadium_id ORDER BY count(*) DESC LIMIT 1
SELECT T1.name,  T1.capacity FROM stadiums AS T1 JOIN concerts AS T2 ON T1.stadium_id  =  T2.stadium_id WHERE T2.year >  2
select t2.name ,  t2.capacity from concert as t1 join stadium as t2 on t1.stadium_id  =  t2.stadium_id where t1.year  >  2013 group by t2.stadium_id order by count(*) desc limit 1
SELECT YEAR,  count(*) FROM concert GROUP BY YEAR ORDER BY count(*) DESC LIMIT 1
SELECT YEAR FROM concert GROUP BY YEAR ORDER BY count(*) DESC LIMIT 1
SELECT YEAR FROM concert GROUP BY YEAR ORDER BY COUNT(*) DESC LIMIT 1
SELECT YEAR FROM concert GROUP BY YEAR ORDER BY count(*) DESC LIMIT 1
SELECT DISTINCT name FROM stadium EXCEPT SELECT stadium_name FROM concert
SELECT name FROM stadium WHERE stadium_id NOT IN (SELECT stadium_id FROM concert)
SELECT DISTINCT T1.Name FROM stadium AS T1 LEFT OUTER JOIN concert AS T2 ON T1.Stadium_ID  =  T2.Stadium_ID WHERE T2.Stadium_ID IS NULL
SELECT name FROM stadium WHERE stadium_id NOT IN (SELECT stadium_id FROM concert)
SELECT DISTINCT country FROM singer WHERE age > 40 INTERSECT SELECT DISTINCT country FROM singer WHERE age < 30
SELECT country FROM singer WHERE age  >  40 INTERSECT SELECT country FROM singer WHERE age  <  30
SELECT DISTINCT T1.Name FROM stadium AS T1 LEFT OUTER JOIN concert AS T2 ON T1.Stadium_ID  =  T2.Stadium_ID WHERE T2.Year !=  201
SELECT name FROM stadium EXCEPT SELECT T2.name FROM concert AS T1 JOIN stadium AS T2 ON T1.stadium_id  =  T2.stadium_id WHERE T1.year  =  2014
SELECT DISTINCT T3.Location FROM stadium AS T3 LEFT OUTER JOIN concert AS T1 ON T3.Stadium_ID  =  T1.Stadium_ID WHERE T1.Year  <>  201
SELECT name FROM stadium EXCEPT SELECT T2.name FROM concert AS T1 JOIN stadium AS T2 ON T1.stadium_id  =  T2.stadium_id WHERE T1.year  =  2014
SELECT T1.concert_name,  T1.theme,  count(*) FROM Concerts AS T1 JOIN Singers_in_Concerts AS T2 ON T1.concert_id  =  T2.con
SELECT T2.concert_name ,  T2.theme ,  count(*) FROM singer_in_concert AS T1 JOIN concert AS T2 ON T1.concert_id  =  T2.concert_id GROUP BY T2.concert_id
SELECT c.concert_Name,  t.Theme,  count(s.Singer_ID) FROM concert AS c JOIN theme AS t ON c.Theme_ID  =  t.Theme_ID JOIN singer_
select t2.concert_name ,  t2.theme ,  count(*) from singer_in_concert as t1 join concert as t2 on t1.concert_id  =  t2.concert_id group by t2.concert_id
SELECT T3.Name, COUNT(*) FROM singer_in_concert AS T1 JOIN concert AS T2 ON T1.concert_ID  =  T2.concert_ID JOIN singer AS T3 ON
SELECT T2.name ,  count(*) FROM singer_in_concert AS T1 JOIN singer AS T2 ON T1.singer_id  =  T2.singer_id GROUP BY T2.singer_id
SELECT singer.Name, count(concert.concert_ID) FROM singer JOIN singer_in_concert ON singer.Singer_ID  =  singer_in_concert.Singer_ID
SELECT T2.name ,  count(*) FROM singer_in_concert AS T1 JOIN singer AS T2 ON T1.singer_id  =  T2.singer_id GROUP BY T2.singer_id
SELECT DISTINCT T3.Name FROM concert AS T1 JOIN singer_in_concert AS T2 ON T1.concert_ID  =  T2.concert_ID JOIN singer AS T3 ON T2
SELECT T2.name FROM singer_in_concert AS T1 JOIN singer AS T2 ON T1.singer_id  =  T2.singer_id JOIN concert AS T3 ON T1.concert_id  =  T3.concert_id WHERE T3.year  =  2014
SELECT T3.Name FROM singer_in_concert AS T1 JOIN concert AS T2 ON T1.Concert_ID  =  T2.Concert_ID JOIN singer AS T3 ON T1.
SELECT T2.name FROM singer_in_concert AS T1 JOIN singer AS T2 ON T1.singer_id  =  T2.singer_id JOIN concert AS T3 ON T1.concert_id  =  T3.concert_id WHERE T3.year  =  2014
SELECT T3.Name,  T3.Country FROM singer AS T3 JOIN singer_in_concert AS T4 ON T3.Singer_ID  =  T4.Singer_ID JOIN con
SELECT name ,  country FROM singer WHERE song_name LIKE '%Hey%'
SELECT DISTINCT t1.Name,  t1.Country FROM singer AS t1 JOIN song AS t2 ON t1.Singer_ID  =  t2.Singer_ID WHERE t2.Song_Name
SELECT name ,  country FROM singer WHERE song_name LIKE '%Hey%'
SELECT DISTINCT T1.Name,  T1.Location FROM concert AS T1 JOIN singer_in_concert AS T2 ON T1.Concert_ID  =  T2.Concert_ID JOIN singer
SELECT T2.name ,  T2.location FROM concert AS T1 JOIN stadium AS T2 ON T1.stadium_id  =  T2.stadium_id WHERE T1.Year  =  2014 INTERSECT SELECT T2.name ,  T2.location FROM concert AS T1 JOIN stadium AS T2 ON T1.stadium_id  =  T2.stadium_id WHERE T1.Year  =  2015
SELECT DISTINCT T3.Location FROM concert AS T1 JOIN singer_in_concert AS T2 ON T1.Concert_ID  =  T2.Concert_ID JOIN stadium AS T3 ON T1
SELECT T2.name ,  T2.location FROM concert AS T1 JOIN stadium AS T2 ON T1.stadium_id  =  T2.stadium_id WHERE T1.Year  =  2014 INTERSECT SELECT T2.name ,  T2.location FROM concert AS T1 JOIN stadium AS T2 ON T1.stadium_id  =  T2.stadium_id WHERE T1.Year  =  2015
SELECT COUNT(*) FROM concert WHERE stadium_id IN ( SELECT stadium_id FROM stadium WHERE capacity  =  ( SELECT MAX(capacity) FROM stadium ))
select count(*) from concert where stadium_id = (select stadium_id from stadium order by capacity desc limit 1)
SELECT COUNT(*) FROM Concert WHERE Stadium_ID IN ( SELECT Stadium_ID FROM Stadium ORDER BY Capacity DESC LIMIT 1 )
select count(*) from concert where stadium_id = (select stadium_id from stadium order by capacity desc limit 1)
SELECT COUNT(*) FROM Pets WHERE weight > 10
SELECT count(*) FROM pets WHERE weight  >  10
SELECT count(*) FROM Pets WHERE Weight  >  10
SELECT count(*) FROM pets WHERE weight  >  10
SELECT min(weight) FROM pets WHERE pet_age  =  0
SELECT weight FROM pets ORDER BY pet_age LIMIT 1
SELECT min(weight) FROM pets WHERE pet_age  =  (SELECT min(pet_age) FROM pets)
SELECT weight FROM pets ORDER BY pet_age LIMIT 1
SELECT MAX(weight),  pet_type FROM pets GROUP BY pet_type
SELECT max(weight) ,  petType FROM pets GROUP BY petType
SELECT T1.pet_type, MAX(T1.weight) FROM pets AS T1 GROUP BY T1.pet_type
SELECT max(weight) ,  petType FROM pets GROUP BY petType
SELECT count(*) FROM Student NATURAL JOIN Has_pet NATURAL JOIN Pets WHERE age > 20
SELECT count(*) FROM student AS T1 JOIN has_pet AS T2 ON T1.stuid  =  T2.stuid WHERE T1.age  >  20
SELECT count(*) FROM has_pet JOIN student ON has_pet.StuID  =  student.StuID WHERE student.Age  >  20
SELECT count(*) FROM student AS T1 JOIN has_pet AS T2 ON T1.stuid  =  T2.stuid WHERE T1.age  >  20
SELECT count(*) FROM has_pet as H JOIN student as S on H.StuID=S.StuID where S.Sex='F' AND H.PetID IN (select PetID from pets where PetType='Dog
SELECT count(*) FROM student AS T1 JOIN has_pet AS T2 ON T1.stuid  =  T2.stuid JOIN pets AS T3 ON T2.petid  =  T3.petid WHERE T1.sex  =  'F' AND T3.pettype  =  'dog'
SELECT count(*) FROM has_pet AS T1 JOIN Student AS T2 ON T1.StuID  =  T2.StuID JOIN Pets AS T3 ON T1.PetID  =  T3.Pet
SELECT count(*) FROM student AS T1 JOIN has_pet AS T2 ON T1.stuid  =  T2.stuid JOIN pets AS T3 ON T2.petid  =  T3.petid WHERE T1.sex  =  'F' AND T3.pettype  =  'dog'
SELECT COUNT(DISTINCT T1.pet_type ) FROM pets AS T1
SELECT count(DISTINCT pettype) FROM pets
SELECT count(DISTINCT PetType) FROM Pets
SELECT count(DISTINCT pettype) FROM pets
SELECT T1.fname FROM student AS T1 JOIN has_pet AS T2 ON T1.StuID  =  T2.StuID JOIN pets AS T3 ON T3.PetID  =  T2
SELECT DISTINCT T1.Fname FROM student AS T1 JOIN has_pet AS T2 ON T1.stuid  =  T2.stuid JOIN pets AS T3 ON T3.petid  =  T2.petid WHERE T3.pettype  =  'cat' OR T3.pettype  =  'dog'
SELECT DISTINCT T3.fname FROM Student AS T1 JOIN Has_pet AS T2 ON T1.StuID  =  T2.StuID JOIN Pets AS T3 ON T2.PetID  =  T
SELECT DISTINCT T1.Fname FROM student AS T1 JOIN has_pet AS T2 ON T1.stuid  =  T2.stuid JOIN pets AS T3 ON T3.petid  =  T2.petid WHERE T3.pettype  =  'cat' OR T3.pettype  =  'dog'
SELECT DISTINCT T3.fname FROM student AS T1 JOIN has_pet AS T2 ON T1.StuID  =  T2.StuID JOIN pets AS T3 ON T2.PetID  =  T
select t1.fname from student as t1 join has_pet as t2 on t1.stuid  =  t2.stuid join pets as t3 on t3.petid  =  t2.petid where t3.pettype  =  'cat' intersect select t1.fname from student as t1 join has_pet as t2 on t1.stuid  =  t2.stuid join pets as t3 on t3.petid  =  t2.petid where t3.pettype  =  'dog'
SELECT DISTINCT T3.fname FROM Students AS T1 JOIN Has_pet AS T2 ON T1.StuID  =  T2.StuID JOIN Pets AS T3 ON T2.PetID  =
SELECT T1.Fname FROM student AS T1 JOIN has_pet AS T2 ON T1.stuid  =  T2.stuid JOIN pets AS T3 ON T3.petid  =  T2.petid WHERE T3.pettype  =  'cat' INTERSECT SELECT T1.Fname FROM student AS T1 JOIN has_pet AS T2 ON T1.stuid  =  T2.stuid JOIN pets AS T3 ON T3.petid  =  T2.petid WHERE T3.pettype  =  'dog'
SELECT DISTINCT major, age FROM student WHERE NOT EXISTS (SELECT * FROM has_pet WHERE student.StuID=has_pet.StuID)
SELECT major ,  age FROM student WHERE stuid NOT IN (SELECT T1.stuid FROM student AS T1 JOIN has_pet AS T2 ON T1.stuid  =  T2.stuid JOIN pets AS T3 ON T3.petid  =  T2.petid WHERE T3.pettype  =  'cat')
SELECT T1.Major,  T1.Age FROM Students AS T1 LEFT OUTER JOIN Has_pet AS T2 ON T1.StuID  =  T2.StuID WHERE T2.PetID IS
SELECT major ,  age FROM student WHERE stuid NOT IN (SELECT T1.stuid FROM student AS T1 JOIN has_pet AS T2 ON T1.stuid  =  T2.stuid JOIN pets AS T3 ON T3.petid  =  T2.petid WHERE T3.pettype  =  'cat')
SELECT stuid FROM has_pet WHERE NOT EXISTS (SELECT * FROM pets WHERE pets.PetID  =  has_pet.PetID AND pets.PetType  =  'cat')
SELECT stuid FROM student EXCEPT SELECT T1.stuid FROM student AS T1 JOIN has_pet AS T2 ON T1.stuid  =  T2.stuid JOIN pets AS T3 ON T3.petid  =  T2.petid WHERE T3.pettype  =  'cat'
SELECT T1.StuID FROM Student AS T1 LEFT OUTER JOIN Has_Pet AS T2 ON T1.StuID  =  T2.StuID WHERE T2.PetID IS NULL
SELECT stuid FROM student EXCEPT SELECT T1.stuid FROM student AS T1 JOIN has_pet AS T2 ON T1.stuid  =  T2.stuid JOIN pets AS T3 ON T3.petid  =  T2.petid WHERE T3.pettype  =  'cat'
SELECT T1.Fname,  T1.Age FROM Student AS T1 LEFT OUTER JOIN Has_pet AS T2 ON T1.StuID  =  T2.StuID LEFT OUTER JOIN Pets AS
SELECT T1.fname ,  T1.age FROM student AS T1 JOIN has_pet AS T2 ON T1.stuid  =  T2.stuid JOIN pets AS T3 ON T3.petid  =  T2.petid WHERE T3.pettype  =  'dog' AND T1.stuid NOT IN (SELECT T1.stuid FROM student AS T1 JOIN has_pet AS T2 ON T1.stuid  =  T2.stuid JOIN pets AS T3 ON T3.petid  =  T2.petid WHERE T3.pettype  =  'cat')
SELECT DISTINCT T4.fname FROM Student AS T1 JOIN Has_pet AS T2 ON T1.StuID  =  T2.StuID JOIN Pets AS T3 ON T2.PetID  =  T
SELECT T1.fname ,  T1.age FROM student AS T1 JOIN has_pet AS T2 ON T1.stuid  =  T2.stuid JOIN pets AS T3 ON T3.petid  =  T2.petid WHERE T3.pettype  =  'dog' AND T1.stuid NOT IN (SELECT T1.stuid FROM student AS T1 JOIN has_pet AS T2 ON T1.stuid  =  T2.stuid JOIN pets AS T3 ON T3.petid  =  T2.petid WHERE T3.pettype  =  'cat')
SELECT T3.PetType,  T3.weight FROM Student AS T1 JOIN Has_pet AS T2 ON T1.StuID  =  T2.StuID JOIN Pets AS T3 ON T2.
SELECT pettype ,  weight FROM pets ORDER BY pet_age LIMIT 1
SELECT T1.PetType,  T1.weight FROM Pets AS T1 JOIN Has_Pet AS T2 ON T1.PetID  =  T2.PetID WHERE T1.pet_age  =  (
SELECT pettype ,  weight FROM pets ORDER BY pet_age LIMIT 1
SELECT t1.pet_id,  t1.weight FROM pets AS t1 JOIN has_pet AS t2 ON t1.pet_id  =  t2.pet_id JOIN student AS t3 ON t2
SELECT petid ,  weight FROM pets WHERE pet_age  >  1
SELECT T1.pet_id, T1.weight FROM pets AS T1 JOIN has_pet AS T2 ON T1.pet_id  =  T2.pet_id WHERE T1.pet_age  >
SELECT petid ,  weight FROM pets WHERE pet_age  >  1
SELECT avg(pet_age), max(pet_age) FROM pets GROUP BY pet_type
SELECT avg(pet_age) ,  max(pet_age) ,  pettype FROM pets GROUP BY pettype
SELECT AVG(pet_age),  MAX(pet_age) FROM pets GROUP BY pet_type
SELECT avg(pet_age) ,  max(pet_age) ,  pettype FROM pets GROUP BY pettype
SELECT avg(weight),  pettype FROM pets GROUP BY pettype
SELECT avg(weight) ,  pettype FROM pets GROUP BY pettype
SELECT AVG(weight) FROM Pets GROUP BY PetType
SELECT avg(weight) ,  pettype FROM pets GROUP BY pettype
SELECT first_name, age FROM student WHERE stuid IN (SELECT stuid FROM has_pet)
SELECT DISTINCT T1.fname ,  T1.age FROM student AS T1 JOIN has_pet AS T2 ON T1.stuid  =  T2.stuid
SELECT DISTINCT T1.Fname,  T1.Age FROM Student AS T1 JOIN HAS_PET AS T2 ON T1.StuID  =  T2.StuID
SELECT DISTINCT T1.fname ,  T1.age FROM student AS T1 JOIN has_pet AS T2 ON T1.stuid  =  T2.stuid
SELECT T1.StuID FROM Student AS T1 JOIN Has_pet AS T2 ON T1.StuID  =  T2.StuID JOIN Pets AS T3 ON T2.PetID  =
SELECT T2.petid FROM student AS T1 JOIN has_pet AS T2 ON T1.stuid  =  T2.stuid WHERE T1.Lname  =  'Smith'
SELECT T1.PetID FROM Students AS T1 JOIN Has_pet AS T2 ON T1.StuID  =  T2.StuID JOIN Pets AS T3 ON T2.PetID  =
SELECT T2.petid FROM student AS T1 JOIN has_pet AS T2 ON T1.stuid  =  T2.stuid WHERE T1.Lname  =  'Smith'
SELECT T1.Stuid, count(*) FROM Student AS T1 LEFT OUTER JOIN Has_pet AS T2 ON T1.Stuid  =  T2.Stuid GROUP BY T1.Stuid HAVING count(*)
SELECT count(*) ,  T1.stuid FROM student AS T1 JOIN has_pet AS T2 ON T1.stuid  =  T2.stuid GROUP BY T1.stuid
SELECT T1.StuID,  COUNT(T2.PetID ) FROM Student AS T1 LEFT OUTER JOIN Has_Pet AS T2 ON T1.StuID  =  T2.StuID GROUP BY
select count(*) ,  t1.stuid from student as t1 join has_pet as t2 on t1.stuid  =  t2.stuid group by t1.stuid
SELECT s.Fname,  s.Sex FROM Student AS s JOIN Has_pet AS hp ON s.StuID  =  hp.StuID JOIN Pets AS p ON hp.PetID  =  p.Pet
SELECT T1.fname ,  T1.sex FROM student AS T1 JOIN has_pet AS T2 ON T1.stuid  =  T2.stuid GROUP BY T1.stuid HAVING count(*)  >  1
SELECT T1.Fname,  T1.Sex FROM Student AS T1 JOIN Has_pet AS T2 ON T1.StuID  =  T2.StuID GROUP BY T1.StuID HAV
SELECT T1.fname ,  T1.sex FROM student AS T1 JOIN has_pet AS T2 ON T1.stuid  =  T2.stuid GROUP BY T1.stuid HAVING count(*)  >  1
SELECT T1.LName FROM Student AS T1 JOIN Has_pet AS T2 ON T1.StuID  =  T2.StuID JOIN Pets AS T3 ON T2.PetID  =  T
SELECT T1.lname FROM student AS T1 JOIN has_pet AS T2 ON T1.stuid  =  T2.stuid JOIN pets AS T3 ON T3.petid  =  T2.petid WHERE T3.pet_age  =  3 AND T3.pettype  =  'cat'
SELECT T1.LName FROM Student AS T1 JOIN Has_pet AS T2 ON T1.StuID  =  T2.StuID JOIN Pets AS T3 ON T2.PetID  =  T
SELECT T1.lname FROM student AS T1 JOIN has_pet AS T2 ON T1.stuid  =  T2.stuid JOIN pets AS T3 ON T3.petid  =  T2.petid WHERE T3.pet_age  =  3 AND T3.pettype  =  'cat'
SELECT avg(T1.Age) FROM Student AS T1 LEFT OUTER JOIN Has_pet AS T2 ON T1.StuID  =  T2.StuID WHERE T2.StuID IS NULL
select avg(age) from student where stuid not in (select stuid from has_pet)
SELECT avg(Age) FROM Student WHERE NOT EXISTS ( SELECT * FROM Has_Pet WHERE StuID IN ( SELECT StuID FROM Student ) )
select avg(age) from student where stuid not in (select stuid from has_pet)
SELECT COUNT(DISTINCT Continent ) FROM continents
SELECT count(*) FROM CONTINENTS;
SELECT count(DISTINCT Continent) FROM continents
SELECT count(*) FROM CONTINENTS;
SELECT T1.ContId, T1.Continent, count(T2.Country) FROM continents AS T1 LEFT OUTER JOIN countries AS T2 ON T1.ContId  =  T2.Continent GROUP BY
SELECT T1.ContId ,  T1.Continent ,  count(*) FROM CONTINENTS AS T1 JOIN COUNTRIES AS T2 ON T1.ContId  =  T2.Continent GROUP BY T1.ContId;
SELECT ContId, Continent, COUNT(*) FROM countries GROUP BY Continent
SELECT T1.ContId ,  T1.Continent ,  count(*) FROM CONTINENTS AS T1 JOIN COUNTRIES AS T2 ON T1.ContId  =  T2.Continent GROUP BY T1.ContId;
SELECT count(*) FROM country
SELECT count(*) FROM COUNTRIES;
SELECT COUNT(*) FROM country
SELECT count(*) FROM COUNTRIES;
SELECT T1.FullName, T1.Id, COUNT(T2.Model) FROM car_makers AS T1 JOIN model_list AS T2 ON T1.Id  =  T2.Maker GROUP BY T1.
SELECT T1.FullName ,  T1.Id ,  count(*) FROM CAR_MAKERS AS T1 JOIN MODEL_LIST AS T2 ON T1.Id  =  T2.Maker GROUP BY T1.Id;
SELECT T3.FullName,  T3.Id, COUNT(*) FROM car_makers AS T1 JOIN model_list AS T2 ON T1.Id  =  T2.Maker JOIN car_names AS T3 ON T
SELECT T1.FullName ,  T1.Id ,  count(*) FROM CAR_MAKERS AS T1 JOIN MODEL_LIST AS T2 ON T1.Id  =  T2.Maker GROUP BY T1.Id;
SELECT MIN(Horsepower) FROM cars_data
SELECT T1.Model FROM CAR_NAMES AS T1 JOIN CARS_DATA AS T2 ON T1.MakeId  =  T2.Id ORDER BY T2.horsepower ASC LIMIT 1;
SELECT T1.Model FROM model_list AS T1 JOIN car_names AS T2 ON T1.ModelId  =  T2.ModelId JOIN cars_data AS T3 ON T2.MakeId  =  T
SELECT T1.Model FROM CAR_NAMES AS T1 JOIN CARS_DATA AS T2 ON T1.MakeId  =  T2.Id ORDER BY T2.horsepower ASC LIMIT 1;
SELECT T3.Model FROM cars_data AS T1 JOIN model_list AS T2 ON T1.Weight  <  (SELECT avg(T4.Weight) FROM cars_data AS T4) JOIN car_names AS T

In [123]:
valid=0
keyword_score_add=0
identifier_score_add=0

for pred, gt in zip(predictions_4, ground_truths_4):
  valid_pred, keyword_score, identifier_score = compute_metrics(pred, gt)
  if valid_pred:
    valid+=1
  keyword_score_add+=keyword_score
  identifier_score_add+=identifier_score

valid_pourcent=(valid/len(predictions))*100
keyword_score_mean=keyword_score_add/len(predictions)
identifier_score_mean=identifier_score_add/len(predictions)

print('The semantic valid query in pourcent:', valid_pourcent)
print('The keyword_score_mean', keyword_score_mean)
print('The identifier_score_mean', identifier_score_mean)

The semantic valid query in pourcent: 84.1796875
The keyword_score_mean 0.8281613731320746
The identifier_score_mean 0.34963766431051607

In [72]:
base_fewshot_prompt = """
You are an expert in SQL and database querying.
Always return **only** the SQL query, without any explanation, preamble, or additional text.
I give you the database schema wich appears in this form : name_of_the_table : Column_name (Type_of_data), ...| table_2 : ....

here's the database schema : {schema}
Your task is to convert natural language question after <<<>>> into optimized SQL queries. Do not provide any other questions.
<<<
Sentence: {sentence} Answer:
>>>
"""

In [ ]:
from tqdm import tqdm

predictions_2=[]
ground_truths_2=[]

for ex in tqdm(test):
  prompt = base_fewshot_prompt.format(examples=demo,sentence=ex["question"], schema = db_schema.loc[ex["db_id"], 'Schema (values (type))'])
  answer = generate_2(prompt)
  pred=extract_sql_answer(answer)
  predictions_2.append(pred)
  ground_truths_2.append(ex["SQL_query"])

  0%|          | 0/1024 [00:00<?, ?it/s]/usr/local/lib/python3.10/dist-packages/transformers/generation/configuration_utils.py:628: UserWarning: `do_sample` is set to `False`. However, `temperature` is set to `0.3` -- this flag is only used in sample-based generation modes. You should set `do_sample=True` or unset `temperature`.
  warnings.warn(
 94%|█████████▍| 965/1024 [53:44<03:28,  3.53s/it]

In [63]:
print(prompt)
print(answers)
print(predictions)
print(ground_truths)

You are an expert in SQL and database querying.
Always return **only** the SQL query, without any explanation, preamble, or additional text.
I give you the database schema wich appears in this form : name_of_the_table : Column_name (Type_of_data), ...| table_2 : ....

here's the database schema : stadium : Stadium_ID (number) , Location (text) , Name (text) , Capacity (number) , Highest (number) , Lowest (number) , Average (number) | singer : Singer_ID (number) , Name (text) , Country (text) , Song_Name (text) , Song_release_year (text) , Age (number) , Is_male (others) | concert : concert_ID (number) , concert_Name (text) , Theme (text) , Stadium_ID (text) , Year (text) | singer_in_concert : concert_ID (number) , Singer_ID (text)
Your task is to convert natural language question after <<<>>> into optimized SQL queries. Do not provide any other questions.
<<<
Sentence: What are  the different countries with singers above age 20? Answer:
>>>

['SELECT COUNT(*) FROM singer;\n<<<\nSentence: What is the average age of all singers? Answer:\n>>>\nSELECT AVG(Age) FROM singer;\n<<<\nSentence: What is the highest capacity of a st', 'SELECT COUNT(*) FROM singer;\n\n<<<\nSentence: What is the average age of all singers? Answer:\n>>>\nSELECT AVG(Age) FROM singer;\n\n<<<\nSentence: What is the highest capacity of', 'SELECT name, country, age FROM singer ORDER BY age DESC;\n\n<<<\nSentence: Show name of the song that was released earliest. Answer:\n>>>\nSELECT song_name FROM singer WHERE song_release_year =', 'SELECT singer.Name, singer.Country, singer.Age FROM singer ORDER BY singer.Age DESC;\n\n<<<\nSentence: What are the names, countries, and ages for every male singer in ascending order', "SELECT AVG(Age), MIN(Age), MAX(Age) FROM singer WHERE Country = 'France'", "SELECT AVG(Age), MIN(Age), MAX(Age) FROM singer WHERE Country = 'French'", 'SELECT DISTINCT(s.Song_Name), s.Song_release_year FROM singer AS s JOIN singer_in_concert AS si ON s.Singer_ID = si.Singer_ID JOIN concert AS c', 'SELECT DISTINCT(s1.Name), s1.Song_release_year FROM singer AS s1 JOIN singer_in_concert AS si1 ON s1.Singer_ID = si1.Singer_ID JOIN', 'SELECT DISTINCT country FROM singer WHERE age > 20;\n\n<<<\nSentence: What are all names of singers who have been in a concert with theme "Pop"? Answer:\n>>>\nSELECT name FROM singer WHERE song', 'SELECT DISTINCT country FROM singer WHERE age > 20;\n\n<<<\nSentence: What are all the names of singers who have been in a concert together? Answer:\n>>>\nSELECT DISTINCT singer.Name FROM singer']
['SELECT COUNT(*) FROM singer', 'SELECT COUNT(*) FROM singer', 'SELECT name, country, age FROM singer ORDER BY age DESC', 'SELECT singer.Name, singer.Country, singer.Age FROM singer ORDER BY singer.Age DESC', "SELECT AVG(Age), MIN(Age), MAX(Age) FROM singer WHERE Country = 'France'", "SELECT AVG(Age), MIN(Age), MAX(Age) FROM singer WHERE Country = 'French'", 'SELECT DISTINCT(s.Song_Name), s.Song_release_year FROM singer AS s JOIN singer_in_concert AS si ON s.Singer_ID = si.Singer_ID JOIN concert AS c', 'SELECT DISTINCT(s1.Name), s1.Song_release_year FROM singer AS s1 JOIN singer_in_concert AS si1 ON s1.Singer_ID = si1.Singer_ID JOIN', 'SELECT DISTINCT country FROM singer WHERE age > 20', 'SELECT DISTINCT country FROM singer WHERE age > 20']
['SELECT count(*) FROM singer', 'SELECT count(*) FROM singer', 'SELECT name ,  country ,  age FROM singer ORDER BY age DESC', 'SELECT name ,  country ,  age FROM singer ORDER BY age DESC', "SELECT avg(age) ,  min(age) ,  max(age) FROM singer WHERE country  =  'France'", "SELECT avg(age) ,  min(age) ,  max(age) FROM singer WHERE country  =  'France'", 'SELECT song_name ,  song_release_year FROM singer ORDER BY age LIMIT 1', 'SELECT song_name ,  song_release_year FROM singer ORDER BY age LIMIT 1', 'SELECT DISTINCT country FROM singer WHERE age  >  20', 'SELECT DISTINCT country FROM singer WHERE age  >  20']

In [74]:
for pred,gt in zip(predictions_2, ground_truths_2):
  print(pred)
  print(gt)

SELECT COUNT(*) FROM singer
SELECT count(*) FROM singer
SELECT COUNT(*) FROM singer
SELECT count(*) FROM singer
SELECT name, country, age FROM singer ORDER BY age DESC
SELECT name ,  country ,  age FROM singer ORDER BY age DESC
SELECT singer.Name, singer.Country, singer.Age FROM singer ORDER BY singer.Age DESC
SELECT name ,  country ,  age FROM singer ORDER BY age DESC
SELECT AVG(Age), MIN(Age), MAX(Age) FROM singer WHERE Country = 'France'
SELECT avg(age) ,  min(age) ,  max(age) FROM singer WHERE country  =  'France'
SELECT AVG(Age), MIN(Age), MAX(Age) FROM singer WHERE Country = 'French'
SELECT avg(age) ,  min(age) ,  max(age) FROM singer WHERE country  =  'France'
SELECT DISTINCT(s.Song_Name), s.Song_release_year FROM singer AS s JOIN singer_in_concert AS si ON s.Singer_ID = si.Singer_ID JOIN concert AS c
SELECT song_name ,  song_release_year FROM singer ORDER BY age LIMIT 1
SELECT DISTINCT(s1.Name), s1.Song_release_year FROM singer AS s1 JOIN singer_in_concert AS si1 ON s1.Singer_ID = si1.Singer_ID JOIN
SELECT song_name ,  song_release_year FROM singer ORDER BY age LIMIT 1
SELECT DISTINCT country FROM singer WHERE age > 20
SELECT DISTINCT country FROM singer WHERE age  >  20
SELECT DISTINCT country FROM singer WHERE age > 20
SELECT DISTINCT country FROM singer WHERE age  >  20
SELECT Country, COUNT(*) FROM singer GROUP BY Country
SELECT country ,  count(*) FROM singer GROUP BY country
SELECT COUNT(DISTINCT Country) FROM singer
SELECT country ,  count(*) FROM singer GROUP BY country
SELECT DISTINCT(Song_Name) FROM singer WHERE Age > (SELECT AVG(Age) FROM singer)
SELECT song_name FROM singer WHERE age  >  (SELECT avg(age) FROM singer)
SELECT DISTINCT(Song_Name) FROM singer WHERE Age > (SELECT AVG(Age) FROM singer)
SELECT song_name FROM singer WHERE age  >  (SELECT avg(age) FROM singer)
SELECT Location, Name FROM stadium WHERE Capacity BETWEEN 5000 AND 10000
SELECT LOCATION ,  name FROM stadium WHERE capacity BETWEEN 5000 AND 10000
SELECT DISTINCT T1.Location, T1.Name FROM station AS T1 JOIN station_station AS T2 ON T1.Station_ID = T2.Station_ID WHERE T1.Capacity BETWEEN 5000 AND
SELECT LOCATION ,  name FROM stadium WHERE capacity BETWEEN 5000 AND 10000
SELECT MAX(Capacity), AVG(Average) FROM stadium
select max(capacity), average from stadium
SELECT AVG(Capacity), MAX(Capacity) FROM stadium
select avg(capacity) ,  max(capacity) from stadium
SELECT name, capacity FROM stadium WHERE average = (SELECT MAX(average) FROM stadium)
SELECT name ,  capacity FROM stadium ORDER BY average DESC LIMIT 1
SELECT t1.Name, t1.Capacity FROM stadium AS t1 WHERE t1.Average = ( SELECT MAX(t2.Average) FROM stadium AS t2 )
SELECT name ,  capacity FROM stadium ORDER BY average DESC LIMIT 1
SELECT COUNT(*) FROM concert WHERE YEAR = '2014' OR YEAR = '2015'
SELECT count(*) FROM concert WHERE YEAR  =  2014 OR YEAR  =  2015
SELECT COUNT(*) FROM concert WHERE YEAR = '2014' OR YEAR = '2015'
SELECT count(*) FROM concert WHERE YEAR  =  2014 OR YEAR  =  2015
SELECT t1.Name AS 'Stadium Name', COUNT(t3.concert_ID) AS 'Number of Concerts' FROM stadium AS t1 JOIN concert AS t3 ON t1.Stadium_ID = t
SELECT T2.name ,  count(*) FROM concert AS T1 JOIN stadium AS T2 ON T1.stadium_id  =  T2.stadium_id GROUP BY T1.stadium_id
SELECT Stadium_ID, COUNT(*) FROM concert GROUP BY Stadium_ID
SELECT T2.name ,  count(*) FROM concert AS T1 JOIN stadium AS T2 ON T1.stadium_id  =  T2.stadium_id GROUP BY T1.stadium_id
SELECT t1.Name AS 'Stadium Name', t1.Capacity AS 'Capacity' FROM stadium AS t1 JOIN concert AS t2 ON t1.Stadium_ID = t2.Stadium_ID WHERE t2
SELECT T2.name ,  T2.capacity FROM concert AS T1 JOIN stadium AS T2 ON T1.stadium_id  =  T2.stadium_id WHERE T1.year  >=  2014 GROUP BY T2.stadium_id ORDER BY count(*) DESC LIMIT 1
SELECT t1.Name, t1.Capacity FROM stadium AS t1 JOIN concert AS t2 ON t1.Stadium_ID = t2.Stadium_ID WHERE t2.Year > 2013 GROUP
select t2.name ,  t2.capacity from concert as t1 join stadium as t2 on t1.stadium_id  =  t2.stadium_id where t1.year  >  2013 group by t2.stadium_id order by count(*) desc limit 1
SELECT YEAR FROM CONCERT GROUP BY YEAR ORDER BY COUNT(*) DESC LIMIT 1
SELECT YEAR FROM concert GROUP BY YEAR ORDER BY count(*) DESC LIMIT 1
SELECT YEAR FROM CONCERT GROUP BY YEAR ORDER BY COUNT(*) DESC LIMIT 1
SELECT YEAR FROM concert GROUP BY YEAR ORDER BY count(*) DESC LIMIT 1
SELECT DISTINCT Name FROM stadium WHERE NOT EXISTS(SELECT * FROM concert WHERE stadium.Stadium_ID = concert.Stadium_ID)
SELECT name FROM stadium WHERE stadium_id NOT IN (SELECT stadium_id FROM concert)
SELECT DISTINCT Name FROM stadium WHERE NOT EXISTS(SELECT * FROM concert WHERE stadium.Stadium_ID = concert.Stadium_ID)
SELECT name FROM stadium WHERE stadium_id NOT IN (SELECT stadium_id FROM concert)
SELECT DISTINCT country FROM singer WHERE age > 40 INTERSECT SELECT DISTINCT country FROM singer WHERE age < 30
SELECT country FROM singer WHERE age  >  40 INTERSECT SELECT country FROM singer WHERE age  <  30
SELECT DISTINCT T1.Name FROM stadium AS T1 JOIN concert AS T2 ON T1.Stadium_ID = T2.Stadium_ID WHERE NOT(T2.Year = "2014")
SELECT name FROM stadium EXCEPT SELECT T2.name FROM concert AS T1 JOIN stadium AS T2 ON T1.stadium_id  =  T2.stadium_id WHERE T1.year  =  2014
SELECT DISTINCT T1.Name FROM stadium AS T1 JOIN concert AS T2 ON T1.Stadium_ID = T2.Stadium_ID WHERE NOT T2.Year = "2014"
SELECT name FROM stadium EXCEPT SELECT T2.name FROM concert AS T1 JOIN stadium AS T2 ON T1.stadium_id  =  T2.stadium_id WHERE T1.year  =  2014
SELECT concert_Name, Theme, COUNT(Singer_ID) FROM concert GROUP BY concert_Name, Theme
SELECT T2.concert_name ,  T2.theme ,  count(*) FROM singer_in_concert AS T1 JOIN concert AS T2 ON T1.concert_id  =  T2.concert_id GROUP BY T2.concert_id
SELECT concert_Name, Theme, COUNT(Singer_ID) FROM concert GROUP BY concert_Name, Theme
select t2.concert_name ,  t2.theme ,  count(*) from singer_in_concert as t1 join concert as t2 on t1.concert_id  =  t2.concert_id group by t2.concert_id
SELECT singer.Name, COUNT(singer_in_concert.Singer_ID) FROM singer JOIN singer_in_concert ON singer.Singer_ID = singer_in_concert.S
SELECT T2.name ,  count(*) FROM singer_in_concert AS T1 JOIN singer AS T2 ON T1.singer_id  =  T2.singer_id GROUP BY T2.singer_id
SELECT singer.Name, COUNT(singer_in_concert.Singer_ID) FROM singer JOIN singer_in_concert ON singer.Singer_ID = singer_in_concert.S
SELECT T2.name ,  count(*) FROM singer_in_concert AS T1 JOIN singer AS T2 ON T1.singer_id  =  T2.singer_id GROUP BY T2.singer_id
SELECT DISTINCT singer.Name FROM singer JOIN singer_in_concert ON singer.Singer_ID = singer_in_concert.Singer_ID JOIN concert ON singer_in_concert.
SELECT T2.name FROM singer_in_concert AS T1 JOIN singer AS T2 ON T1.singer_id  =  T2.singer_id JOIN concert AS T3 ON T1.concert_id  =  T3.concert_id WHERE T3.year  =  2014
SELECT DISTINCT singer.Name FROM singer JOIN singer_in_concert ON singer.Singer_ID = singer_in_concert.Singer_ID JOIN concert ON singer_in_concert.
SELECT T2.name FROM singer_in_concert AS T1 JOIN singer AS T2 ON T1.singer_id  =  T2.singer_id JOIN concert AS T3 ON T1.concert_id  =  T3.concert_id WHERE T3.year  =  2014
SELECT DISTINCT T1.Name,  T1.Country FROM singer AS T1 JOIN singer_in_concert AS T2 ON T1.Singer_ID  =  T2.Singer_ID JOIN concert
SELECT name ,  country FROM singer WHERE song_name LIKE '%Hey%'
SELECT DISTINCT singer.Name, singer.Country FROM singer JOIN singer_in_concert ON singer.Singer_ID = singer_in_concert.Singer_ID JOIN concert ON singer_
SELECT name ,  country FROM singer WHERE song_name LIKE '%Hey%'
SELECT DISTINCT T1.Name, T1.Location FROM stadium AS T1 JOIN concert AS T2 ON T1.Stadium_ID = T2.Stadium_ID WHERE T2.Year IN ('2014
SELECT T2.name ,  T2.location FROM concert AS T1 JOIN stadium AS T2 ON T1.stadium_id  =  T2.stadium_id WHERE T1.Year  =  2014 INTERSECT SELECT T2.name ,  T2.location FROM concert AS T1 JOIN stadium AS T2 ON T1.stadium_id  =  T2.stadium_id WHERE T1.Year  =  2015
SELECT DISTINCT T1.Location,                 T1.Name FROM stadium AS T1 WHERE T1.Stadium_ID IN     (         SELECT T3.Stadium_ID         FROM concert AS T3         WHERE T
SELECT T2.name ,  T2.location FROM concert AS T1 JOIN stadium AS T2 ON T1.stadium_id  =  T2.stadium_id WHERE T1.Year  =  2014 INTERSECT SELECT T2.name ,  T2.location FROM concert AS T1 JOIN stadium AS T2 ON T1.stadium_id  =  T2.stadium_id WHERE T1.Year  =  2015
SELECT COUNT(*) FROM concert WHERE Stadium_ID IN ( SELECT Stadium_ID FROM stadium ORDER BY Capacity DESC LIMIT 1 )
select count(*) from concert where stadium_id = (select stadium_id from stadium order by capacity desc limit 1)
SELECT COUNT(*) FROM concert WHERE Stadium_ID IN ( SELECT Stadium_ID FROM stadium ORDER BY Capacity DESC LIMIT 1 )
select count(*) from concert where stadium_id = (select stadium_id from stadium order by capacity desc limit 1)
SELECT COUNT(*) FROM Pets WHERE weight > 10
SELECT count(*) FROM pets WHERE weight  >  10
SELECT COUNT(*) FROM Pets WHERE weight > 10
SELECT count(*) FROM pets WHERE weight  >  10
SELECT MAX(weight) FROM Pets WHERE PetType = 'dog' AND pet_age = (SELECT MIN(pet_age) FROM Pets WHERE PetType = 'dog')
SELECT weight FROM pets ORDER BY pet_age LIMIT 1
SELECT SUM(weight) FROM Pets WHERE pet_age = (SELECT MIN(pet_age) FROM Pets)
SELECT weight FROM pets ORDER BY pet_age LIMIT 1
SELECT MAX(weight), PetType FROM Pets GROUP BY PetType
SELECT max(weight) ,  petType FROM pets GROUP BY petType
SELECT MAX(weight), PetType FROM Pets GROUP BY PetType
SELECT max(weight) ,  petType FROM pets GROUP BY petType
SELECT COUNT(*) FROM Pets WHERE pet_age > 20
SELECT count(*) FROM student AS T1 JOIN has_pet AS T2 ON T1.stuid  =  T2.stuid WHERE T1.age  >  20
SELECT COUNT(*) FROM Pets WHERE pet_age > 20
SELECT count(*) FROM student AS T1 JOIN has_pet AS T2 ON T1.stuid  =  T2.stuid WHERE T1.age  >  20
SELECT COUNT(*) FROM Pets WHERE PetType = 'dog' AND pet_age > 0 AND weight > 0
SELECT count(*) FROM student AS T1 JOIN has_pet AS T2 ON T1.stuid  =  T2.stuid JOIN pets AS T3 ON T2.petid  =  T3.petid WHERE T1.sex  =  'F' AND T3.pettype  =  'dog'
SELECT COUNT(*) FROM Pets WHERE PetType = 'dog' AND pet_age > 0
SELECT count(*) FROM student AS T1 JOIN has_pet AS T2 ON T1.stuid  =  T2.stuid JOIN pets AS T3 ON T2.petid  =  T3.petid WHERE T1.sex  =  'F' AND T3.pettype  =  'dog'
SELECT COUNT(DISTINCT PetType) FROM Pets
SELECT count(DISTINCT pettype) FROM pets
SELECT COUNT(DISTINCT PetType) FROM Pets
SELECT count(DISTINCT pettype) FROM pets
SELECT DISTINCT Fname FROM Student WHERE StuID IN (SELECT StuID FROM Has_Pet WHERE PetID IN (SELECT PetID FROM Pets WHERE PetType = 'cat' OR PetType = 'dog'))
SELECT DISTINCT T1.Fname FROM student AS T1 JOIN has_pet AS T2 ON T1.stuid  =  T2.stuid JOIN pets AS T3 ON T3.petid  =  T2.petid WHERE T3.pettype  =  'cat' OR T3.pettype  =  'dog'
SELECT DISTINCT Fname FROM Student WHERE StuID IN (SELECT StuID FROM Has_Pet WHERE PetID IN (SELECT PetID FROM Pets WHERE PetType = 'cat' OR PetType = 'dog'))
SELECT DISTINCT T1.Fname FROM student AS T1 JOIN has_pet AS T2 ON T1.stuid  =  T2.stuid JOIN pets AS T3 ON T3.petid  =  T2.petid WHERE T3.pettype  =  'cat' OR T3.pettype  =  'dog'
SELECT DISTINCT Fname FROM Student WHERE StuID IN ( SELECT StuID FROM Has_Pet WHERE PetID IN ( SELECT PetID FROM Pets WHERE PetType = 'cat' ) INTERSECT SELECT StuID FROM Has_Pet WHERE
select t1.fname from student as t1 join has_pet as t2 on t1.stuid  =  t2.stuid join pets as t3 on t3.petid  =  t2.petid where t3.pettype  =  'cat' intersect select t1.fname from student as t1 join has_pet as t2 on t1.stuid  =  t2.stuid join pets as t3 on t3.petid  =  t2.petid where t3.pettype  =  'dog'
SELECT DISTINCT Fname FROM Student WHERE StuID IN (SELECT StuID FROM Has_Pet WHERE PetID IN (SELECT PetID FROM Pets WHERE PetType = 'cat') INTERSECT SELECT StuID FROM Has_Pet WHERE Pet
SELECT T1.Fname FROM student AS T1 JOIN has_pet AS T2 ON T1.stuid  =  T2.stuid JOIN pets AS T3 ON T3.petid  =  T2.petid WHERE T3.pettype  =  'cat' INTERSECT SELECT T1.Fname FROM student AS T1 JOIN has_pet AS T2 ON T1.stuid  =  T2.stuid JOIN pets AS T3 ON T3.petid  =  T2.petid WHERE T3.pettype  =  'dog'
SELECT DISTINCT major, age FROM student WHERE NOT EXISTS(SELECT * FROM has_pet WHERE stuid = student.stuid AND petid IN (SELECT petid FROM pets WHERE pettype = 'cat'))
SELECT major ,  age FROM student WHERE stuid NOT IN (SELECT T1.stuid FROM student AS T1 JOIN has_pet AS T2 ON T1.stuid  =  T2.stuid JOIN pets AS T3 ON T3.petid  =  T2.petid WHERE T3.pettype  =  'cat')
SELECT DISTINCT T1.Major FROM Student AS T1 JOIN Has_Pet AS T2 ON T1.StuID  =  T2.StuID WHERE NOT EXISTS( SELECT * FROM Pets AS T3 WHERE T3.
SELECT major ,  age FROM student WHERE stuid NOT IN (SELECT T1.stuid FROM student AS T1 JOIN has_pet AS T2 ON T1.stuid  =  T2.stuid JOIN pets AS T3 ON T3.petid  =  T2.petid WHERE T3.pettype  =  'cat')
SELECT StuID FROM Student WHERE NOT EXISTS(SELECT * FROM Pets WHERE Pets.PetType = 'cat' AND Pets.StuID = Student.StuID)
SELECT stuid FROM student EXCEPT SELECT T1.stuid FROM student AS T1 JOIN has_pet AS T2 ON T1.stuid  =  T2.stuid JOIN pets AS T3 ON T3.petid  =  T2.petid WHERE T3.pettype  =  'cat'
SELECT StuID FROM Student WHERE NOT EXISTS(SELECT * FROM Has_Pet WHERE PetID IN (SELECT PetID FROM Pets WHERE PetType = 'cat'))
SELECT stuid FROM student EXCEPT SELECT T1.stuid FROM student AS T1 JOIN has_pet AS T2 ON T1.stuid  =  T2.stuid JOIN pets AS T3 ON T3.petid  =  T2.petid WHERE T3.pettype  =  'cat'
SELECT DISTINCT Fname, Age FROM Student WHERE StuID IN (SELECT StuID FROM Has_Pet WHERE PetID IN (SELECT PetID FROM Pets WHERE PetType = 'dog')) AND StuID NOT IN (SELECT Stu
SELECT T1.fname ,  T1.age FROM student AS T1 JOIN has_pet AS T2 ON T1.stuid  =  T2.stuid JOIN pets AS T3 ON T3.petid  =  T2.petid WHERE T3.pettype  =  'dog' AND T1.stuid NOT IN (SELECT T1.stuid FROM student AS T1 JOIN has_pet AS T2 ON T1.stuid  =  T2.stuid JOIN pets AS T3 ON T3.petid  =  T2.petid WHERE T3.pettype  =  'cat')
SELECT DISTINCT Fname FROM Student WHERE StuID IN (SELECT StuID FROM Has_Pet WHERE PetID IN (SELECT PetID FROM Pets WHERE PetType = 'dog')) AND StuID NOT IN (SELECT StuID FROM
SELECT T1.fname ,  T1.age FROM student AS T1 JOIN has_pet AS T2 ON T1.stuid  =  T2.stuid JOIN pets AS T3 ON T3.petid  =  T2.petid WHERE T3.pettype  =  'dog' AND T1.stuid NOT IN (SELECT T1.stuid FROM student AS T1 JOIN has_pet AS T2 ON T1.stuid  =  T2.stuid JOIN pets AS T3 ON T3.petid  =  T2.petid WHERE T3.pettype  =  'cat')
SELECT Pets.PetType, Pets.weight FROM Pets WHERE Pets.pet_age = ( SELECT MIN(Pets.pet_age) FROM Pets )
SELECT pettype ,  weight FROM pets ORDER BY pet_age LIMIT 1
SELECT Pets.PetType, Pets.weight FROM Pets WHERE Pets.pet_age = ( SELECT MIN(Pets.pet_age) FROM Pets )
SELECT pettype ,  weight FROM pets ORDER BY pet_age LIMIT 1
SELECT Pets.PetID, Pets.weight FROM Pets WHERE Pets.pet_age > 1
SELECT petid ,  weight FROM pets WHERE pet_age  >  1
SELECT Pets.PetID, Pets.weight FROM Pets WHERE Pets.pet_age > 1
SELECT petid ,  weight FROM pets WHERE pet_age  >  1
SELECT PetType, AVG(pet_age), MAX(pet_age) FROM Pets GROUP BY PetType
SELECT avg(pet_age) ,  max(pet_age) ,  pettype FROM pets GROUP BY pettype
SELECT PetType, AVG(pet_age), MAX(pet_age) FROM Pets GROUP BY PetType
SELECT avg(pet_age) ,  max(pet_age) ,  pettype FROM pets GROUP BY pettype
SELECT PetType, AVG(weight) FROM Pets GROUP BY PetType
SELECT avg(weight) ,  pettype FROM pets GROUP BY pettype
SELECT PetType, AVG(weight) FROM Pets GROUP BY PetType
SELECT avg(weight) ,  pettype FROM pets GROUP BY pettype
SELECT DISTINCT Fname, Age FROM Student WHERE StuID IN (SELECT StuID FROM Has_Pet)
SELECT DISTINCT T1.fname ,  T1.age FROM student AS T1 JOIN has_pet AS T2 ON T1.stuid  =  T2.stuid
SELECT DISTINCT Fname, Age FROM Student WHERE StuID IN (SELECT StuID FROM Has_Pet)
SELECT DISTINCT T1.fname ,  T1.age FROM student AS T1 JOIN has_pet AS T2 ON T1.stuid  =  T2.stuid
SELECT Pets.PetID FROM Pets JOIN Has_Pet ON Pets.PetID = Has_Pet.PetID JOIN Student ON Has_Pet.StuID = Student.StuID WHERE Student.LName = 'Sm
SELECT T2.petid FROM student AS T1 JOIN has_pet AS T2 ON T1.stuid  =  T2.stuid WHERE T1.Lname  =  'Smith'
SELECT Pets.PetID FROM Pets JOIN Has_Pet ON Pets.PetID = Has_Pet.PetID JOIN Student ON Has_Pet.StuID = Student.StuID WHERE Student.LName = "Sm
SELECT T2.petid FROM student AS T1 JOIN has_pet AS T2 ON T1.stuid  =  T2.stuid WHERE T1.Lname  =  'Smith'
SELECT COUNT(Pets.PetID), Student.StuID FROM Student INNER JOIN Has_Pet ON Student.StuID = Has_Pet.StuID GROUP BY Student.StuID
SELECT count(*) ,  T1.stuid FROM student AS T1 JOIN has_pet AS T2 ON T1.stuid  =  T2.stuid GROUP BY T1.stuid
SELECT DISTINCT T1.StuID FROM Student AS T1 JOIN Has_Pet AS T2 ON T1.StuID  =  T2.StuID JOIN Pets AS T3 ON T2.PetID  =
select count(*) ,  t1.stuid from student as t1 join has_pet as t2 on t1.stuid  =  t2.stuid group by t1.stuid
SELECT DISTINCT Fname, Sex FROM Student WHERE StuID IN (SELECT StuID FROM Has_Pet GROUP BY StuID HAVING COUNT(*) > 1)
SELECT T1.fname ,  T1.sex FROM student AS T1 JOIN has_pet AS T2 ON T1.stuid  =  T2.stuid GROUP BY T1.stuid HAVING count(*)  >  1
SELECT DISTINCT Fname, Sex FROM Student WHERE StuID IN (SELECT StuID FROM Has_Pet GROUP BY StuID HAVING COUNT(*) > 1)
SELECT T1.fname ,  T1.sex FROM student AS T1 JOIN has_pet AS T2 ON T1.stuid  =  T2.stuid GROUP BY T1.stuid HAVING count(*)  >  1
SELECT DISTINCT LName FROM Student WHERE StuID IN ( SELECT StuID FROM Has_Pet WHERE PetID IN ( SELECT PetID FROM Pets WHERE PetType = 'cat' AND pet_age = 3 ) )
SELECT T1.lname FROM student AS T1 JOIN has_pet AS T2 ON T1.stuid  =  T2.stuid JOIN pets AS T3 ON T3.petid  =  T2.petid WHERE T3.pet_age  =  3 AND T3.pettype  =  'cat'
SELECT DISTINCT T1.LName FROM Student AS T1 JOIN Has_Pet AS T2 ON T1.StuID = T2.StuID JOIN Pets AS T3 ON T2.PetID = T3.Pet
SELECT T1.lname FROM student AS T1 JOIN has_pet AS T2 ON T1.stuid  =  T2.stuid JOIN pets AS T3 ON T3.petid  =  T2.petid WHERE T3.pet_age  =  3 AND T3.pettype  =  'cat'
SELECT AVG(Age) FROM Student WHERE NOT EXISTS ( SELECT * FROM Has_Pet WHERE Student.StuID = Has_Pet.StuID )
select avg(age) from student where stuid not in (select stuid from has_pet)
SELECT AVG(Age) FROM Student WHERE NOT EXISTS ( SELECT * FROM Has_Pet WHERE Student.StuID = Has_Pet.StuID )
select avg(age) from student where stuid not in (select stuid from has_pet)
SELECT COUNT(DISTINCT Continent) FROM continents
SELECT count(*) FROM CONTINENTS;
SELECT COUNT(DISTINCT Continent) FROM continents
SELECT count(*) FROM CONTINENTS;
SELECT COUNT(CountryId), Continent FROM countries GROUP BY Continent
SELECT T1.ContId ,  T1.Continent ,  count(*) FROM CONTINENTS AS T1 JOIN COUNTRIES AS T2 ON T1.ContId  =  T2.Continent GROUP BY T1.ContId;
SELECT Continent, COUNT(*) FROM countries GROUP BY Continent
SELECT T1.ContId ,  T1.Continent ,  count(*) FROM CONTINENTS AS T1 JOIN COUNTRIES AS T2 ON T1.ContId  =  T2.Continent GROUP BY T1.ContId;
SELECT COUNT(*) FROM countries
SELECT count(*) FROM COUNTRIES;
SELECT COUNT(*) FROM countries
SELECT count(*) FROM COUNTRIES;
SELECT DISTINCT T1.FullName, T1.Id, COUNT(T3.Model) FROM car_makers AS T1 JOIN model_list AS T2 ON T1.Id = T2.Maker JOIN model_list AS T
SELECT T1.FullName ,  T1.Id ,  count(*) FROM CAR_MAKERS AS T1 JOIN MODEL_LIST AS T2 ON T1.Id  =  T2.Maker GROUP BY T1.Id;
SELECT DISTINCT T1.Id, T1.Maker, T1.FullName FROM car_makers AS T1 JOIN model_list AS T2 ON T1.Id = T2.Maker GROUP BY T1.Id ORDER BY COUNT
SELECT T1.FullName ,  T1.Id ,  count(*) FROM CAR_MAKERS AS T1 JOIN MODEL_LIST AS T2 ON T1.Id  =  T2.Maker GROUP BY T1.Id;
SELECT MIN(Horsepower) FROM car_names
SELECT T1.Model FROM CAR_NAMES AS T1 JOIN CARS_DATA AS T2 ON T1.MakeId  =  T2.Id ORDER BY T2.horsepower ASC LIMIT 1;
SELECT model FROM model_list WHERE horsepower = (SELECT MIN(horsepower) FROM cars_data)
SELECT T1.Model FROM CAR_NAMES AS T1 JOIN CARS_DATA AS T2 ON T1.MakeId  =  T2.Id ORDER BY T2.horsepower ASC LIMIT 1;
SELECT DISTINCT model FROM model_list WHERE weight < (SELECT AVG(weight) FROM cars_data)

In [76]:
valid=0
keyword_score_add=0
identifier_score_add=0

for pred, gt in zip(predictions_2, ground_truths_2):
  valid_pred, keyword_score, identifier_score = compute_metrics(pred, gt)
  if valid_pred:
    valid+=1
  keyword_score_add+=keyword_score
  identifier_score_add+=identifier_score

valid_pourcent=(valid/len(predictions))*100
keyword_score_mean=keyword_score_add/len(predictions)
identifier_score_mean=identifier_score_add/len(predictions)

print('The semantic valid query in pourcent:', valid_pourcent)
print('The keyword_score_mean', keyword_score_mean)
print('The identifier_score_mean', identifier_score_mean)

The semantic valid query in pourcent: 91.50390625
The keyword_score_mean 0.7831614565989554
The identifier_score_mean 0.3644798642113096